Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x7f2 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x8cad5): GNU C11 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp.dp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x12d569): ../AZURE_RTOS/App/app_azure_rtos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x118a9c): E:/2.Git/github/stm32h7r7_study/2.software/app/Appli/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 3 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 7	(unsigned)
    <2d>   DW_AT_name        : (indirect string, offset: 0x8cac8): unsigned int
 <1><31>: Abbrev Number: 18 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 5	(signed)
    <34>   DW_AT_name        : int
 <1><38>: Abbrev Number: 3 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x8e72): long long int
 <1><3f>: Abbrev Number: 3 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 8
    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0xae207): long double
 <1><46>: Abbrev Number: 3 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0x105b6b): signed char
 <1><4d>: Abbrev Number: 5 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0xa402c): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 3 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0x989c1): unsigned char
 <1><60>: Abbrev Number: 3 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x7ee55): short int
 <1><67>: Abbrev Number: 5 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0x5332): __uint16_t
    <6c>   DW_AT_decl_file   : 2
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 3 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x55bbf): short unsigned int
 <1><7a>: Abbrev Number: 3 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : (indirect string, offset: 0x104dee): long int
 <1><81>: Abbrev Number: 5 (DW_TAG_typedef)
    <82>   DW_AT_name        : (indirect string, offset: 0xff4e): __uint32_t
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 79
    <88>   DW_AT_decl_column : 25
    <89>   DW_AT_type        : <0x8d>
 <1><8d>: Abbrev Number: 3 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x8d172): long unsigned int
 <1><94>: Abbrev Number: 3 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 7	(unsigned)
    <97>   DW_AT_name        : (indirect string, offset: 0x9b484): long long unsigned int
 <1><9b>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <9c>   DW_AT_byte_size   : 4
 <1><9d>: Abbrev Number: 3 (DW_TAG_base_type)
    <9e>   DW_AT_byte_size   : 1
    <9f>   DW_AT_encoding    : 8	(unsigned char)
    <a0>   DW_AT_name        : (indirect string, offset: 0x105b72): char
 <1><a4>: Abbrev Number: 5 (DW_TAG_typedef)
    <a5>   DW_AT_name        : (indirect string, offset: 0xa1950): CHAR
    <a9>   DW_AT_decl_file   : 3
    <aa>   DW_AT_decl_line   : 114
    <ab>   DW_AT_decl_column : 49
    <ac>   DW_AT_type        : <0x9d>
 <1><b0>: Abbrev Number: 5 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0xa194f): UCHAR
    <b5>   DW_AT_decl_file   : 3
    <b6>   DW_AT_decl_line   : 115
    <b7>   DW_AT_decl_column : 49
    <b8>   DW_AT_type        : <0x59>
 <1><bc>: Abbrev Number: 5 (DW_TAG_typedef)
    <bd>   DW_AT_name        : (indirect string, offset: 0xd4460): UINT
    <c1>   DW_AT_decl_file   : 3
    <c2>   DW_AT_decl_line   : 117
    <c3>   DW_AT_decl_column : 49
    <c4>   DW_AT_type        : <0x2a>
 <1><c8>: Abbrev Number: 5 (DW_TAG_typedef)
    <c9>   DW_AT_name        : (indirect string, offset: 0x17002): ULONG
    <cd>   DW_AT_decl_file   : 3
    <ce>   DW_AT_decl_line   : 119
    <cf>   DW_AT_decl_column : 49
    <d0>   DW_AT_type        : <0x8d>
 <1><d4>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d5>   DW_AT_name        : (indirect string, offset: 0x3e274): TX_TIMER_INTERNAL_STRUCT
    <d9>   DW_AT_byte_size   : 28
    <da>   DW_AT_decl_file   : 4
    <da>   DW_AT_decl_line   : 384
    <dc>   DW_AT_decl_column : 16
    <dc>   DW_AT_sibling     : <0x143>
 <2><e0>: Abbrev Number: 1 (DW_TAG_member)
    <e1>   DW_AT_name        : (indirect string, offset: 0xdb24b): tx_timer_internal_remaining_ticks
    <e5>   DW_AT_decl_file   : 4
    <e6>   DW_AT_decl_line   : 388
    <e8>   DW_AT_decl_column : 25
    <e9>   DW_AT_type        : <0xc8>
    <ed>   DW_AT_data_member_location: 0
 <2><ee>: Abbrev Number: 1 (DW_TAG_member)
    <ef>   DW_AT_name        : (indirect string, offset: 0x12cbde): tx_timer_internal_re_initialize_ticks
    <f3>   DW_AT_decl_file   : 4
    <f4>   DW_AT_decl_line   : 389
    <f6>   DW_AT_decl_column : 25
    <f7>   DW_AT_type        : <0xc8>
    <fb>   DW_AT_data_member_location: 4
 <2><fc>: Abbrev Number: 1 (DW_TAG_member)
    <fd>   DW_AT_name        : (indirect string, offset: 0x3d03f): tx_timer_internal_timeout_function
    <101>   DW_AT_decl_file   : 4
    <102>   DW_AT_decl_line   : 392
    <104>   DW_AT_decl_column : 27
    <105>   DW_AT_type        : <0x14e>
    <109>   DW_AT_data_member_location: 8
 <2><10a>: Abbrev Number: 1 (DW_TAG_member)
    <10b>   DW_AT_name        : (indirect string, offset: 0x116283): tx_timer_internal_timeout_param
    <10f>   DW_AT_decl_file   : 4
    <110>   DW_AT_decl_line   : 393
    <112>   DW_AT_decl_column : 25
    <113>   DW_AT_type        : <0xc8>
    <117>   DW_AT_data_member_location: 12
 <2><118>: Abbrev Number: 1 (DW_TAG_member)
    <119>   DW_AT_name        : (indirect string, offset: 0x7f29b): tx_timer_internal_active_next
    <11d>   DW_AT_decl_file   : 4
    <11e>   DW_AT_decl_line   : 399
    <120>   DW_AT_decl_column : 26
    <121>   DW_AT_type        : <0x153>
    <125>   DW_AT_data_member_location: 16
 <2><126>: Abbrev Number: 1 (DW_TAG_member)
    <127>   DW_AT_name        : (indirect string, offset: 0xca7e9): tx_timer_internal_active_previous
    <12b>   DW_AT_decl_file   : 4
    <12c>   DW_AT_decl_line   : 400
    <12e>   DW_AT_decl_column : 26
    <12f>   DW_AT_type        : <0x153>
    <133>   DW_AT_data_member_location: 20
 <2><134>: Abbrev Number: 1 (DW_TAG_member)
    <135>   DW_AT_name        : (indirect string, offset: 0xaeef7): tx_timer_internal_list_head
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 404
    <13c>   DW_AT_decl_column : 27
    <13d>   DW_AT_type        : <0x158>
    <141>   DW_AT_data_member_location: 24
 <2><142>: Abbrev Number: 0
 <1><143>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <144>   DW_AT_prototyped  : 1
    <144>   DW_AT_sibling     : <0x14e>
 <2><148>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <149>   DW_AT_type        : <0xc8>
 <2><14d>: Abbrev Number: 0
 <1><14e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <14f>   DW_AT_byte_size   : 4
    <14f>   DW_AT_type        : <0x143>
 <1><153>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <154>   DW_AT_byte_size   : 4
    <154>   DW_AT_type        : <0xd4>
 <1><158>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <159>   DW_AT_byte_size   : 4
    <159>   DW_AT_type        : <0x153>
 <1><15d>: Abbrev Number: 8 (DW_TAG_typedef)
    <15e>   DW_AT_name        : (indirect string, offset: 0x102b66): TX_TIMER_INTERNAL
    <162>   DW_AT_decl_file   : 4
    <163>   DW_AT_decl_line   : 409
    <165>   DW_AT_decl_column : 3
    <165>   DW_AT_type        : <0xd4>
 <1><169>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <16a>   DW_AT_byte_size   : 4
    <16a>   DW_AT_type        : <0xa4>
 <1><16e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <16f>   DW_AT_name        : (indirect string, offset: 0xfcc9f): TX_THREAD_STRUCT
    <173>   DW_AT_byte_size   : 176
    <174>   DW_AT_decl_file   : 4
    <174>   DW_AT_decl_line   : 468
    <176>   DW_AT_decl_column : 16
    <176>   DW_AT_sibling     : <0x38f>
 <2><17a>: Abbrev Number: 1 (DW_TAG_member)
    <17b>   DW_AT_name        : (indirect string, offset: 0x10472e): tx_thread_id
    <17f>   DW_AT_decl_file   : 4
    <180>   DW_AT_decl_line   : 475
    <182>   DW_AT_decl_column : 25
    <183>   DW_AT_type        : <0xc8>
    <187>   DW_AT_data_member_location: 0
 <2><188>: Abbrev Number: 1 (DW_TAG_member)
    <189>   DW_AT_name        : (indirect string, offset: 0x124961): tx_thread_run_count
    <18d>   DW_AT_decl_file   : 4
    <18e>   DW_AT_decl_line   : 476
    <190>   DW_AT_decl_column : 25
    <191>   DW_AT_type        : <0xc8>
    <195>   DW_AT_data_member_location: 4
 <2><196>: Abbrev Number: 1 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x110b81): tx_thread_stack_ptr
    <19b>   DW_AT_decl_file   : 4
    <19c>   DW_AT_decl_line   : 477
    <19e>   DW_AT_decl_column : 26
    <19f>   DW_AT_type        : <0x9b>
    <1a3>   DW_AT_data_member_location: 8
 <2><1a4>: Abbrev Number: 1 (DW_TAG_member)
    <1a5>   DW_AT_name        : (indirect string, offset: 0xed7f): tx_thread_stack_start
    <1a9>   DW_AT_decl_file   : 4
    <1aa>   DW_AT_decl_line   : 478
    <1ac>   DW_AT_decl_column : 26
    <1ad>   DW_AT_type        : <0x9b>
    <1b1>   DW_AT_data_member_location: 12
 <2><1b2>: Abbrev Number: 1 (DW_TAG_member)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xc6244): tx_thread_stack_end
    <1b7>   DW_AT_decl_file   : 4
    <1b8>   DW_AT_decl_line   : 479
    <1ba>   DW_AT_decl_column : 26
    <1bb>   DW_AT_type        : <0x9b>
    <1bf>   DW_AT_data_member_location: 16
 <2><1c0>: Abbrev Number: 1 (DW_TAG_member)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x29d31): tx_thread_stack_size
    <1c5>   DW_AT_decl_file   : 4
    <1c6>   DW_AT_decl_line   : 480
    <1c8>   DW_AT_decl_column : 25
    <1c9>   DW_AT_type        : <0xc8>
    <1cd>   DW_AT_data_member_location: 20
 <2><1ce>: Abbrev Number: 1 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0x135fc5): tx_thread_time_slice
    <1d3>   DW_AT_decl_file   : 4
    <1d4>   DW_AT_decl_line   : 481
    <1d6>   DW_AT_decl_column : 25
    <1d7>   DW_AT_type        : <0xc8>
    <1db>   DW_AT_data_member_location: 24
 <2><1dc>: Abbrev Number: 1 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0xee31d): tx_thread_new_time_slice
    <1e1>   DW_AT_decl_file   : 4
    <1e2>   DW_AT_decl_line   : 482
    <1e4>   DW_AT_decl_column : 25
    <1e5>   DW_AT_type        : <0xc8>
    <1e9>   DW_AT_data_member_location: 28
 <2><1ea>: Abbrev Number: 1 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x106e4d): tx_thread_ready_next
    <1ef>   DW_AT_decl_file   : 4
    <1f0>   DW_AT_decl_line   : 486
    <1f2>   DW_AT_decl_column : 26
    <1f3>   DW_AT_type        : <0x38f>
    <1f7>   DW_AT_data_member_location: 32
 <2><1f8>: Abbrev Number: 1 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x962d1): tx_thread_ready_previous
    <1fd>   DW_AT_decl_file   : 4
    <1fe>   DW_AT_decl_line   : 487
    <200>   DW_AT_decl_column : 26
    <201>   DW_AT_type        : <0x38f>
    <205>   DW_AT_data_member_location: 36
 <2><206>: Abbrev Number: 1 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0x1a403): tx_thread_name
    <20b>   DW_AT_decl_file   : 4
    <20c>   DW_AT_decl_line   : 495
    <20e>   DW_AT_decl_column : 26
    <20f>   DW_AT_type        : <0x169>
    <213>   DW_AT_data_member_location: 40
 <2><214>: Abbrev Number: 1 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x43591): tx_thread_priority
    <219>   DW_AT_decl_file   : 4
    <21a>   DW_AT_decl_line   : 496
    <21c>   DW_AT_decl_column : 25
    <21d>   DW_AT_type        : <0xbc>
    <221>   DW_AT_data_member_location: 44
 <2><222>: Abbrev Number: 1 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0xf18b2): tx_thread_state
    <227>   DW_AT_decl_file   : 4
    <228>   DW_AT_decl_line   : 497
    <22a>   DW_AT_decl_column : 25
    <22b>   DW_AT_type        : <0xbc>
    <22f>   DW_AT_data_member_location: 48
 <2><230>: Abbrev Number: 1 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0xfb398): tx_thread_delayed_suspend
    <235>   DW_AT_decl_file   : 4
    <236>   DW_AT_decl_line   : 498
    <238>   DW_AT_decl_column : 25
    <239>   DW_AT_type        : <0xbc>
    <23d>   DW_AT_data_member_location: 52
 <2><23e>: Abbrev Number: 1 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0xec18a): tx_thread_suspending
    <243>   DW_AT_decl_file   : 4
    <244>   DW_AT_decl_line   : 499
    <246>   DW_AT_decl_column : 25
    <247>   DW_AT_type        : <0xbc>
    <24b>   DW_AT_data_member_location: 56
 <2><24c>: Abbrev Number: 1 (DW_TAG_member)
    <24d>   DW_AT_name        : (indirect string, offset: 0xdfddc): tx_thread_preempt_threshold
    <251>   DW_AT_decl_file   : 4
    <252>   DW_AT_decl_line   : 500
    <254>   DW_AT_decl_column : 25
    <255>   DW_AT_type        : <0xbc>
    <259>   DW_AT_data_member_location: 60
 <2><25a>: Abbrev Number: 1 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0xa433): tx_thread_schedule_hook
    <25f>   DW_AT_decl_file   : 4
    <260>   DW_AT_decl_line   : 505
    <262>   DW_AT_decl_column : 27
    <263>   DW_AT_type        : <0x3a4>
    <267>   DW_AT_data_member_location: 64
 <2><268>: Abbrev Number: 1 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0xfa5c3): tx_thread_entry
    <26d>   DW_AT_decl_file   : 4
    <26e>   DW_AT_decl_line   : 513
    <270>   DW_AT_decl_column : 27
    <271>   DW_AT_type        : <0x14e>
    <275>   DW_AT_data_member_location: 68
 <2><276>: Abbrev Number: 1 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x4c0ac): tx_thread_entry_parameter
    <27b>   DW_AT_decl_file   : 4
    <27c>   DW_AT_decl_line   : 514
    <27e>   DW_AT_decl_column : 25
    <27f>   DW_AT_type        : <0xc8>
    <283>   DW_AT_data_member_location: 72
 <2><284>: Abbrev Number: 1 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0xc8835): tx_thread_timer
    <289>   DW_AT_decl_file   : 4
    <28a>   DW_AT_decl_line   : 518
    <28c>   DW_AT_decl_column : 25
    <28d>   DW_AT_type        : <0x15d>
    <291>   DW_AT_data_member_location: 76
 <2><292>: Abbrev Number: 1 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0xe4d84): tx_thread_suspend_cleanup
    <297>   DW_AT_decl_file   : 4
    <298>   DW_AT_decl_line   : 524
    <29a>   DW_AT_decl_column : 27
    <29b>   DW_AT_type        : <0x3a4>
    <29f>   DW_AT_data_member_location: 104
 <2><2a0>: Abbrev Number: 1 (DW_TAG_member)
    <2a1>   DW_AT_name        : (indirect string, offset: 0xc2b5a): tx_thread_suspend_control_block
    <2a5>   DW_AT_decl_file   : 4
    <2a6>   DW_AT_decl_line   : 525
    <2a8>   DW_AT_decl_column : 26
    <2a9>   DW_AT_type        : <0x9b>
    <2ad>   DW_AT_data_member_location: 108
 <2><2ae>: Abbrev Number: 1 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0x1118b0): tx_thread_suspended_next
    <2b3>   DW_AT_decl_file   : 4
    <2b4>   DW_AT_decl_line   : 527
    <2b6>   DW_AT_decl_column : 26
    <2b7>   DW_AT_type        : <0x38f>
    <2bb>   DW_AT_data_member_location: 112
 <2><2bc>: Abbrev Number: 1 (DW_TAG_member)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x6b89a): tx_thread_suspended_previous
    <2c1>   DW_AT_decl_file   : 4
    <2c2>   DW_AT_decl_line   : 528
    <2c4>   DW_AT_decl_column : 26
    <2c5>   DW_AT_type        : <0x38f>
    <2c9>   DW_AT_data_member_location: 116
 <2><2ca>: Abbrev Number: 1 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x89b0d): tx_thread_suspend_info
    <2cf>   DW_AT_decl_file   : 4
    <2d0>   DW_AT_decl_line   : 529
    <2d2>   DW_AT_decl_column : 25
    <2d3>   DW_AT_type        : <0xc8>
    <2d7>   DW_AT_data_member_location: 120
 <2><2d8>: Abbrev Number: 1 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x86dc7): tx_thread_additional_suspend_info
    <2dd>   DW_AT_decl_file   : 4
    <2de>   DW_AT_decl_line   : 530
    <2e0>   DW_AT_decl_column : 26
    <2e1>   DW_AT_type        : <0x9b>
    <2e5>   DW_AT_data_member_location: 124
 <2><2e6>: Abbrev Number: 1 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0xd322a): tx_thread_suspend_option
    <2eb>   DW_AT_decl_file   : 4
    <2ec>   DW_AT_decl_line   : 531
    <2ee>   DW_AT_decl_column : 25
    <2ef>   DW_AT_type        : <0xbc>
    <2f3>   DW_AT_data_member_location: 128
 <2><2f4>: Abbrev Number: 1 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x7b5f7): tx_thread_suspend_status
    <2f9>   DW_AT_decl_file   : 4
    <2fa>   DW_AT_decl_line   : 532
    <2fc>   DW_AT_decl_column : 25
    <2fd>   DW_AT_type        : <0xbc>
    <301>   DW_AT_data_member_location: 132
 <2><302>: Abbrev Number: 1 (DW_TAG_member)
    <303>   DW_AT_name        : (indirect string, offset: 0x40698): tx_thread_created_next
    <307>   DW_AT_decl_file   : 4
    <308>   DW_AT_decl_line   : 541
    <30a>   DW_AT_decl_column : 26
    <30b>   DW_AT_type        : <0x38f>
    <30f>   DW_AT_data_member_location: 136
 <2><310>: Abbrev Number: 1 (DW_TAG_member)
    <311>   DW_AT_name        : (indirect string, offset: 0x559a7): tx_thread_created_previous
    <315>   DW_AT_decl_file   : 4
    <316>   DW_AT_decl_line   : 542
    <318>   DW_AT_decl_column : 26
    <319>   DW_AT_type        : <0x38f>
    <31d>   DW_AT_data_member_location: 140
 <2><31e>: Abbrev Number: 1 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0x106c71): tx_thread_filex_ptr
    <323>   DW_AT_decl_file   : 4
    <324>   DW_AT_decl_line   : 550
    <326>   DW_AT_decl_column : 26
    <327>   DW_AT_type        : <0x9b>
    <32b>   DW_AT_data_member_location: 144
 <2><32c>: Abbrev Number: 1 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x1e44a): tx_thread_user_priority
    <331>   DW_AT_decl_file   : 4
    <332>   DW_AT_decl_line   : 556
    <334>   DW_AT_decl_column : 25
    <335>   DW_AT_type        : <0xbc>
    <339>   DW_AT_data_member_location: 148
 <2><33a>: Abbrev Number: 1 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x48591): tx_thread_user_preempt_threshold
    <33f>   DW_AT_decl_file   : 4
    <340>   DW_AT_decl_line   : 557
    <342>   DW_AT_decl_column : 25
    <343>   DW_AT_type        : <0xbc>
    <347>   DW_AT_data_member_location: 152
 <2><348>: Abbrev Number: 1 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0x8af8c): tx_thread_inherit_priority
    <34d>   DW_AT_decl_file   : 4
    <34e>   DW_AT_decl_line   : 558
    <350>   DW_AT_decl_column : 25
    <351>   DW_AT_type        : <0xbc>
    <355>   DW_AT_data_member_location: 156
 <2><356>: Abbrev Number: 1 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0x6ecae): tx_thread_owned_mutex_count
    <35b>   DW_AT_decl_file   : 4
    <35c>   DW_AT_decl_line   : 561
    <35e>   DW_AT_decl_column : 25
    <35f>   DW_AT_type        : <0xbc>
    <363>   DW_AT_data_member_location: 160
 <2><364>: Abbrev Number: 1 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0xe2b31): tx_thread_owned_mutex_list
    <369>   DW_AT_decl_file   : 4
    <36a>   DW_AT_decl_line   : 563
    <36c>   DW_AT_decl_column : 26
    <36d>   DW_AT_type        : <0x46c>
    <371>   DW_AT_data_member_location: 164
 <2><372>: Abbrev Number: 1 (DW_TAG_member)
    <373>   DW_AT_name        : (indirect string, offset: 0xa32b1): tx_thread_stack_highest_ptr
    <377>   DW_AT_decl_file   : 4
    <378>   DW_AT_decl_line   : 603
    <37a>   DW_AT_decl_column : 26
    <37b>   DW_AT_type        : <0x9b>
    <37f>   DW_AT_data_member_location: 168
 <2><380>: Abbrev Number: 1 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0x12ba6c): tx_thread_suspension_sequence
    <385>   DW_AT_decl_file   : 4
    <386>   DW_AT_decl_line   : 630
    <388>   DW_AT_decl_column : 25
    <389>   DW_AT_type        : <0xc8>
    <38d>   DW_AT_data_member_location: 172
 <2><38e>: Abbrev Number: 0
 <1><38f>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <390>   DW_AT_byte_size   : 4
    <390>   DW_AT_type        : <0x16e>
 <1><394>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <395>   DW_AT_prototyped  : 1
    <395>   DW_AT_sibling     : <0x3a4>
 <2><399>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <39a>   DW_AT_type        : <0x38f>
 <2><39e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <39f>   DW_AT_type        : <0xc8>
 <2><3a3>: Abbrev Number: 0
 <1><3a4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3a5>   DW_AT_byte_size   : 4
    <3a5>   DW_AT_type        : <0x394>
 <1><3a9>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3aa>   DW_AT_name        : (indirect string, offset: 0xd6992): TX_MUTEX_STRUCT
    <3ae>   DW_AT_byte_size   : 52
    <3af>   DW_AT_decl_file   : 4
    <3af>   DW_AT_decl_line   : 892
    <3b1>   DW_AT_decl_column : 16
    <3b1>   DW_AT_sibling     : <0x46c>
 <2><3b5>: Abbrev Number: 1 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0xec38a): tx_mutex_id
    <3ba>   DW_AT_decl_file   : 4
    <3bb>   DW_AT_decl_line   : 896
    <3bd>   DW_AT_decl_column : 25
    <3be>   DW_AT_type        : <0xc8>
    <3c2>   DW_AT_data_member_location: 0
 <2><3c3>: Abbrev Number: 1 (DW_TAG_member)
    <3c4>   DW_AT_name        : (indirect string, offset: 0xb90e4): tx_mutex_name
    <3c8>   DW_AT_decl_file   : 4
    <3c9>   DW_AT_decl_line   : 899
    <3cb>   DW_AT_decl_column : 26
    <3cc>   DW_AT_type        : <0x169>
    <3d0>   DW_AT_data_member_location: 4
 <2><3d1>: Abbrev Number: 1 (DW_TAG_member)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x86dae): tx_mutex_ownership_count
    <3d6>   DW_AT_decl_file   : 4
    <3d7>   DW_AT_decl_line   : 902
    <3d9>   DW_AT_decl_column : 25
    <3da>   DW_AT_type        : <0xbc>
    <3de>   DW_AT_data_member_location: 8
 <2><3df>: Abbrev Number: 1 (DW_TAG_member)
    <3e0>   DW_AT_name        : (indirect string, offset: 0x7ea07): tx_mutex_owner
    <3e4>   DW_AT_decl_file   : 4
    <3e5>   DW_AT_decl_line   : 906
    <3e7>   DW_AT_decl_column : 26
    <3e8>   DW_AT_type        : <0x556>
    <3ec>   DW_AT_data_member_location: 12
 <2><3ed>: Abbrev Number: 1 (DW_TAG_member)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x4983f): tx_mutex_inherit
    <3f2>   DW_AT_decl_file   : 4
    <3f3>   DW_AT_decl_line   : 910
    <3f5>   DW_AT_decl_column : 25
    <3f6>   DW_AT_type        : <0xbc>
    <3fa>   DW_AT_data_member_location: 16
 <2><3fb>: Abbrev Number: 1 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0x751ae): tx_mutex_original_priority
    <400>   DW_AT_decl_file   : 4
    <401>   DW_AT_decl_line   : 913
    <403>   DW_AT_decl_column : 25
    <404>   DW_AT_type        : <0xbc>
    <408>   DW_AT_data_member_location: 20
 <2><409>: Abbrev Number: 1 (DW_TAG_member)
    <40a>   DW_AT_name        : (indirect string, offset: 0x7358f): tx_mutex_suspension_list
    <40e>   DW_AT_decl_file   : 4
    <40f>   DW_AT_decl_line   : 918
    <411>   DW_AT_decl_column : 26
    <412>   DW_AT_type        : <0x38f>
    <416>   DW_AT_data_member_location: 24
 <2><417>: Abbrev Number: 1 (DW_TAG_member)
    <418>   DW_AT_name        : (indirect string, offset: 0x6c701): tx_mutex_suspended_count
    <41c>   DW_AT_decl_file   : 4
    <41d>   DW_AT_decl_line   : 919
    <41f>   DW_AT_decl_column : 25
    <420>   DW_AT_type        : <0xbc>
    <424>   DW_AT_data_member_location: 28
 <2><425>: Abbrev Number: 1 (DW_TAG_member)
    <426>   DW_AT_name        : (indirect string, offset: 0x1042e4): tx_mutex_created_next
    <42a>   DW_AT_decl_file   : 4
    <42b>   DW_AT_decl_line   : 923
    <42d>   DW_AT_decl_column : 26
    <42e>   DW_AT_type        : <0x46c>
    <432>   DW_AT_data_member_location: 32
 <2><433>: Abbrev Number: 1 (DW_TAG_member)
    <434>   DW_AT_name        : (indirect string, offset: 0x10eb2d): tx_mutex_created_previous
    <438>   DW_AT_decl_file   : 4
    <439>   DW_AT_decl_line   : 924
    <43b>   DW_AT_decl_column : 26
    <43c>   DW_AT_type        : <0x46c>
    <440>   DW_AT_data_member_location: 36
 <2><441>: Abbrev Number: 1 (DW_TAG_member)
    <442>   DW_AT_name        : (indirect string, offset: 0xc0e3): tx_mutex_highest_priority_waiting
    <446>   DW_AT_decl_file   : 4
    <447>   DW_AT_decl_line   : 928
    <449>   DW_AT_decl_column : 25
    <44a>   DW_AT_type        : <0xbc>
    <44e>   DW_AT_data_member_location: 40
 <2><44f>: Abbrev Number: 1 (DW_TAG_member)
    <450>   DW_AT_name        : (indirect string, offset: 0xd6e15): tx_mutex_owned_next
    <454>   DW_AT_decl_file   : 4
    <455>   DW_AT_decl_line   : 932
    <457>   DW_AT_decl_column : 26
    <458>   DW_AT_type        : <0x46c>
    <45c>   DW_AT_data_member_location: 44
 <2><45d>: Abbrev Number: 1 (DW_TAG_member)
    <45e>   DW_AT_name        : (indirect string, offset: 0x1bf9): tx_mutex_owned_previous
    <462>   DW_AT_decl_file   : 4
    <463>   DW_AT_decl_line   : 933
    <465>   DW_AT_decl_column : 26
    <466>   DW_AT_type        : <0x46c>
    <46a>   DW_AT_data_member_location: 48
 <2><46b>: Abbrev Number: 0
 <1><46c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <46d>   DW_AT_byte_size   : 4
    <46d>   DW_AT_type        : <0x3a9>
 <1><471>: Abbrev Number: 8 (DW_TAG_typedef)
    <472>   DW_AT_name        : (indirect string, offset: 0xee5db): TX_THREAD
    <476>   DW_AT_decl_file   : 4
    <477>   DW_AT_decl_line   : 644
    <479>   DW_AT_decl_column : 3
    <479>   DW_AT_type        : <0x16e>
 <1><47d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <47e>   DW_AT_byte_size   : 4
    <47e>   DW_AT_type        : <0xb0>
 <1><482>: Abbrev Number: 7 (DW_TAG_structure_type)
    <483>   DW_AT_name        : (indirect string, offset: 0x11a119): TX_BYTE_POOL_STRUCT
    <487>   DW_AT_byte_size   : 52
    <488>   DW_AT_decl_file   : 4
    <488>   DW_AT_decl_line   : 727
    <48a>   DW_AT_decl_column : 16
    <48a>   DW_AT_sibling     : <0x545>
 <2><48e>: Abbrev Number: 1 (DW_TAG_member)
    <48f>   DW_AT_name        : (indirect string, offset: 0x8fc04): tx_byte_pool_id
    <493>   DW_AT_decl_file   : 4
    <494>   DW_AT_decl_line   : 731
    <496>   DW_AT_decl_column : 25
    <497>   DW_AT_type        : <0xc8>
    <49b>   DW_AT_data_member_location: 0
 <2><49c>: Abbrev Number: 1 (DW_TAG_member)
    <49d>   DW_AT_name        : (indirect string, offset: 0x3f9c3): tx_byte_pool_name
    <4a1>   DW_AT_decl_file   : 4
    <4a2>   DW_AT_decl_line   : 734
    <4a4>   DW_AT_decl_column : 26
    <4a5>   DW_AT_type        : <0x169>
    <4a9>   DW_AT_data_member_location: 4
 <2><4aa>: Abbrev Number: 1 (DW_TAG_member)
    <4ab>   DW_AT_name        : (indirect string, offset: 0x2b740): tx_byte_pool_available
    <4af>   DW_AT_decl_file   : 4
    <4b0>   DW_AT_decl_line   : 737
    <4b2>   DW_AT_decl_column : 25
    <4b3>   DW_AT_type        : <0xc8>
    <4b7>   DW_AT_data_member_location: 8
 <2><4b8>: Abbrev Number: 1 (DW_TAG_member)
    <4b9>   DW_AT_name        : (indirect string, offset: 0x12598a): tx_byte_pool_fragments
    <4bd>   DW_AT_decl_file   : 4
    <4be>   DW_AT_decl_line   : 740
    <4c0>   DW_AT_decl_column : 25
    <4c1>   DW_AT_type        : <0xbc>
    <4c5>   DW_AT_data_member_location: 12
 <2><4c6>: Abbrev Number: 1 (DW_TAG_member)
    <4c7>   DW_AT_name        : (indirect string, offset: 0xef4cb): tx_byte_pool_list
    <4cb>   DW_AT_decl_file   : 4
    <4cc>   DW_AT_decl_line   : 743
    <4ce>   DW_AT_decl_column : 26
    <4cf>   DW_AT_type        : <0x47d>
    <4d3>   DW_AT_data_member_location: 16
 <2><4d4>: Abbrev Number: 1 (DW_TAG_member)
    <4d5>   DW_AT_name        : (indirect string, offset: 0xfdf84): tx_byte_pool_search
    <4d9>   DW_AT_decl_file   : 4
    <4da>   DW_AT_decl_line   : 747
    <4dc>   DW_AT_decl_column : 26
    <4dd>   DW_AT_type        : <0x47d>
    <4e1>   DW_AT_data_member_location: 20
 <2><4e2>: Abbrev Number: 1 (DW_TAG_member)
    <4e3>   DW_AT_name        : (indirect string, offset: 0x12eb9): tx_byte_pool_start
    <4e7>   DW_AT_decl_file   : 4
    <4e8>   DW_AT_decl_line   : 750
    <4ea>   DW_AT_decl_column : 26
    <4eb>   DW_AT_type        : <0x47d>
    <4ef>   DW_AT_data_member_location: 24
 <2><4f0>: Abbrev Number: 1 (DW_TAG_member)
    <4f1>   DW_AT_name        : (indirect string, offset: 0xdc242): tx_byte_pool_size
    <4f5>   DW_AT_decl_file   : 4
    <4f6>   DW_AT_decl_line   : 753
    <4f8>   DW_AT_decl_column : 25
    <4f9>   DW_AT_type        : <0xc8>
    <4fd>   DW_AT_data_member_location: 28
 <2><4fe>: Abbrev Number: 1 (DW_TAG_member)
    <4ff>   DW_AT_name        : (indirect string, offset: 0x98f17): tx_byte_pool_owner
    <503>   DW_AT_decl_file   : 4
    <504>   DW_AT_decl_line   : 759
    <506>   DW_AT_decl_column : 26
    <507>   DW_AT_type        : <0x38f>
    <50b>   DW_AT_data_member_location: 32
 <2><50c>: Abbrev Number: 1 (DW_TAG_member)
    <50d>   DW_AT_name        : (indirect string, offset: 0x69103): tx_byte_pool_suspension_list
    <511>   DW_AT_decl_file   : 4
    <512>   DW_AT_decl_line   : 764
    <514>   DW_AT_decl_column : 26
    <515>   DW_AT_type        : <0x38f>
    <519>   DW_AT_data_member_location: 36
 <2><51a>: Abbrev Number: 1 (DW_TAG_member)
    <51b>   DW_AT_name        : (indirect string, offset: 0xc70aa): tx_byte_pool_suspended_count
    <51f>   DW_AT_decl_file   : 4
    <520>   DW_AT_decl_line   : 765
    <522>   DW_AT_decl_column : 25
    <523>   DW_AT_type        : <0xbc>
    <527>   DW_AT_data_member_location: 40
 <2><528>: Abbrev Number: 1 (DW_TAG_member)
    <529>   DW_AT_name        : (indirect string, offset: 0xe993e): tx_byte_pool_created_next
    <52d>   DW_AT_decl_file   : 4
    <52e>   DW_AT_decl_line   : 769
    <530>   DW_AT_decl_column : 26
    <531>   DW_AT_type        : <0x545>
    <535>   DW_AT_data_member_location: 44
 <2><536>: Abbrev Number: 1 (DW_TAG_member)
    <537>   DW_AT_name        : (indirect string, offset: 0x27e09): tx_byte_pool_created_previous
    <53b>   DW_AT_decl_file   : 4
    <53c>   DW_AT_decl_line   : 770
    <53e>   DW_AT_decl_column : 26
    <53f>   DW_AT_type        : <0x545>
    <543>   DW_AT_data_member_location: 48
 <2><544>: Abbrev Number: 0
 <1><545>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <546>   DW_AT_byte_size   : 4
    <546>   DW_AT_type        : <0x482>
 <1><54a>: Abbrev Number: 8 (DW_TAG_typedef)
    <54b>   DW_AT_name        : (indirect string, offset: 0xa4526): TX_BYTE_POOL
    <54f>   DW_AT_decl_file   : 4
    <550>   DW_AT_decl_line   : 801
    <552>   DW_AT_decl_column : 3
    <552>   DW_AT_type        : <0x482>
 <1><556>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <557>   DW_AT_byte_size   : 4
    <557>   DW_AT_type        : <0x471>
 <1><55b>: Abbrev Number: 5 (DW_TAG_typedef)
    <55c>   DW_AT_name        : (indirect string, offset: 0xa402e): uint8_t
    <560>   DW_AT_decl_file   : 5
    <561>   DW_AT_decl_line   : 24
    <562>   DW_AT_decl_column : 19
    <563>   DW_AT_type        : <0x4d>
 <1><567>: Abbrev Number: 5 (DW_TAG_typedef)
    <568>   DW_AT_name        : (indirect string, offset: 0x5334): uint16_t
    <56c>   DW_AT_decl_file   : 5
    <56d>   DW_AT_decl_line   : 36
    <56e>   DW_AT_decl_column : 20
    <56f>   DW_AT_type        : <0x67>
 <1><573>: Abbrev Number: 5 (DW_TAG_typedef)
    <574>   DW_AT_name        : (indirect string, offset: 0xff50): uint32_t
    <578>   DW_AT_decl_file   : 5
    <579>   DW_AT_decl_line   : 48
    <57a>   DW_AT_decl_column : 20
    <57b>   DW_AT_type        : <0x81>
 <1><57f>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <580>   DW_AT_type        : <0x573>
 <1><584>: Abbrev Number: 10 (DW_TAG_array_type)
    <585>   DW_AT_type        : <0x57f>
    <589>   DW_AT_sibling     : <0x594>
 <2><58d>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <58e>   DW_AT_type        : <0x2a>
    <592>   DW_AT_upper_bound : 1
 <2><593>: Abbrev Number: 0
 <1><594>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <595>   DW_AT_type        : <0x584>
 <1><599>: Abbrev Number: 21 (DW_TAG_structure_type)
    <59a>   DW_AT_byte_size   : 44
    <59b>   DW_AT_decl_file   : 6
    <59c>   DW_AT_decl_line   : 963
    <59e>   DW_AT_decl_column : 9
    <59f>   DW_AT_sibling     : <0x628>
 <2><5a3>: Abbrev Number: 1 (DW_TAG_member)
    <5a4>   DW_AT_name        : (indirect string, offset: 0x11953d): MODER
    <5a8>   DW_AT_decl_file   : 6
    <5a9>   DW_AT_decl_line   : 965
    <5ab>   DW_AT_decl_column : 17
    <5ac>   DW_AT_type        : <0x57f>
    <5b0>   DW_AT_data_member_location: 0
 <2><5b1>: Abbrev Number: 1 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x1099e9): OTYPER
    <5b6>   DW_AT_decl_file   : 6
    <5b7>   DW_AT_decl_line   : 966
    <5b9>   DW_AT_decl_column : 17
    <5ba>   DW_AT_type        : <0x57f>
    <5be>   DW_AT_data_member_location: 4
 <2><5bf>: Abbrev Number: 1 (DW_TAG_member)
    <5c0>   DW_AT_name        : (indirect string, offset: 0xddbea): OSPEEDR
    <5c4>   DW_AT_decl_file   : 6
    <5c5>   DW_AT_decl_line   : 967
    <5c7>   DW_AT_decl_column : 17
    <5c8>   DW_AT_type        : <0x57f>
    <5cc>   DW_AT_data_member_location: 8
 <2><5cd>: Abbrev Number: 1 (DW_TAG_member)
    <5ce>   DW_AT_name        : (indirect string, offset: 0x11f4ed): PUPDR
    <5d2>   DW_AT_decl_file   : 6
    <5d3>   DW_AT_decl_line   : 968
    <5d5>   DW_AT_decl_column : 17
    <5d6>   DW_AT_type        : <0x57f>
    <5da>   DW_AT_data_member_location: 12
 <2><5db>: Abbrev Number: 9 (DW_TAG_member)
    <5dc>   DW_AT_name        : IDR
    <5e0>   DW_AT_decl_file   : 6
    <5e0>   DW_AT_decl_line   : 969
    <5e2>   DW_AT_decl_column : 17
    <5e2>   DW_AT_type        : <0x57f>
    <5e6>   DW_AT_data_member_location: 16
 <2><5e7>: Abbrev Number: 9 (DW_TAG_member)
    <5e8>   DW_AT_name        : ODR
    <5ec>   DW_AT_decl_file   : 6
    <5ec>   DW_AT_decl_line   : 970
    <5ee>   DW_AT_decl_column : 17
    <5ee>   DW_AT_type        : <0x57f>
    <5f2>   DW_AT_data_member_location: 20
 <2><5f3>: Abbrev Number: 1 (DW_TAG_member)
    <5f4>   DW_AT_name        : (indirect string, offset: 0x33728): BSRR
    <5f8>   DW_AT_decl_file   : 6
    <5f9>   DW_AT_decl_line   : 971
    <5fb>   DW_AT_decl_column : 17
    <5fc>   DW_AT_type        : <0x57f>
    <600>   DW_AT_data_member_location: 24
 <2><601>: Abbrev Number: 1 (DW_TAG_member)
    <602>   DW_AT_name        : (indirect string, offset: 0x125da0): LCKR
    <606>   DW_AT_decl_file   : 6
    <607>   DW_AT_decl_line   : 972
    <609>   DW_AT_decl_column : 17
    <60a>   DW_AT_type        : <0x57f>
    <60e>   DW_AT_data_member_location: 28
 <2><60f>: Abbrev Number: 9 (DW_TAG_member)
    <610>   DW_AT_name        : AFR
    <614>   DW_AT_decl_file   : 6
    <614>   DW_AT_decl_line   : 973
    <616>   DW_AT_decl_column : 17
    <616>   DW_AT_type        : <0x594>
    <61a>   DW_AT_data_member_location: 32
 <2><61b>: Abbrev Number: 9 (DW_TAG_member)
    <61c>   DW_AT_name        : BRR
    <620>   DW_AT_decl_file   : 6
    <620>   DW_AT_decl_line   : 974
    <622>   DW_AT_decl_column : 17
    <622>   DW_AT_type        : <0x57f>
    <626>   DW_AT_data_member_location: 40
 <2><627>: Abbrev Number: 0
 <1><628>: Abbrev Number: 8 (DW_TAG_typedef)
    <629>   DW_AT_name        : (indirect string, offset: 0x867dc): GPIO_TypeDef
    <62d>   DW_AT_decl_file   : 6
    <62e>   DW_AT_decl_line   : 975
    <630>   DW_AT_decl_column : 3
    <630>   DW_AT_type        : <0x599>
 <1><634>: Abbrev Number: 3 (DW_TAG_base_type)
    <635>   DW_AT_byte_size   : 4
    <636>   DW_AT_encoding    : 4	(float)
    <637>   DW_AT_name        : (indirect string, offset: 0x65eec): float
 <1><63b>: Abbrev Number: 3 (DW_TAG_base_type)
    <63c>   DW_AT_byte_size   : 8
    <63d>   DW_AT_encoding    : 4	(float)
    <63e>   DW_AT_name        : (indirect string, offset: 0x52c53): double
 <1><642>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <643>   DW_AT_encoding    : 7	(unsigned)
    <644>   DW_AT_byte_size   : 1
    <645>   DW_AT_type        : <0x59>
    <649>   DW_AT_decl_file   : 7
    <64a>   DW_AT_decl_line   : 69
    <64b>   DW_AT_decl_column : 1
    <64c>   DW_AT_sibling     : <0x65d>
 <2><650>: Abbrev Number: 14 (DW_TAG_enumerator)
    <651>   DW_AT_name        : (indirect string, offset: 0x1090fa): GPIO_PIN_RESET
    <655>   DW_AT_const_value : 0
 <2><656>: Abbrev Number: 14 (DW_TAG_enumerator)
    <657>   DW_AT_name        : (indirect string, offset: 0x89a02): GPIO_PIN_SET
    <65b>   DW_AT_const_value : 1
 <2><65c>: Abbrev Number: 0
 <1><65d>: Abbrev Number: 5 (DW_TAG_typedef)
    <65e>   DW_AT_name        : (indirect string, offset: 0x1a99a): GPIO_PinState
    <662>   DW_AT_decl_file   : 7
    <663>   DW_AT_decl_line   : 72
    <664>   DW_AT_decl_column : 3
    <665>   DW_AT_type        : <0x642>
 <1><669>: Abbrev Number: 10 (DW_TAG_array_type)
    <66a>   DW_AT_type        : <0xb0>
    <66e>   DW_AT_sibling     : <0x67a>
 <2><672>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <673>   DW_AT_type        : <0x2a>
    <677>   DW_AT_upper_bound : 32767
 <2><679>: Abbrev Number: 0
 <1><67a>: Abbrev Number: 23 (DW_TAG_variable)
    <67b>   DW_AT_name        : (indirect string, offset: 0xb36e9): tx_byte_pool_buffer
    <67f>   DW_AT_decl_file   : 1
    <680>   DW_AT_decl_line   : 53
    <681>   DW_AT_decl_column : 28
    <682>   DW_AT_type        : <0x669>
    <686>   DW_AT_alignment   : 4
    <687>   DW_AT_location    : 5 byte block: 3 2c 0 0 24 	(DW_OP_addr: 2400002c)
 <1><68d>: Abbrev Number: 6 (DW_TAG_variable)
    <68e>   DW_AT_name        : (indirect string, offset: 0xd0f51): tx_app_byte_pool
    <692>   DW_AT_decl_file   : 1
    <692>   DW_AT_decl_line   : 54
    <693>   DW_AT_decl_column : 21
    <694>   DW_AT_type        : <0x54a>
    <698>   DW_AT_location    : 5 byte block: 3 2c 80 0 24 	(DW_OP_addr: 2400802c)
 <1><69e>: Abbrev Number: 6 (DW_TAG_variable)
    <69f>   DW_AT_name        : (indirect string, offset: 0xa7d63): led_thread
    <6a3>   DW_AT_decl_file   : 1
    <6a3>   DW_AT_decl_line   : 69
    <6a4>   DW_AT_decl_column : 18
    <6a5>   DW_AT_type        : <0x471>
    <6a9>   DW_AT_location    : 5 byte block: 3 60 80 0 24 	(DW_OP_addr: 24008060)
 <1><6af>: Abbrev Number: 10 (DW_TAG_array_type)
    <6b0>   DW_AT_type        : <0x55b>
    <6b4>   DW_AT_sibling     : <0x6c0>
 <2><6b8>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <6b9>   DW_AT_type        : <0x2a>
    <6bd>   DW_AT_upper_bound : 511
 <2><6bf>: Abbrev Number: 0
 <1><6c0>: Abbrev Number: 6 (DW_TAG_variable)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x101ab1): led_thread_buf
    <6c5>   DW_AT_decl_file   : 1
    <6c5>   DW_AT_decl_line   : 70
    <6c6>   DW_AT_decl_column : 16
    <6c7>   DW_AT_type        : <0x6af>
    <6cb>   DW_AT_location    : 5 byte block: 3 10 81 0 24 	(DW_OP_addr: 24008110)
 <1><6d1>: Abbrev Number: 11 (DW_TAG_subprogram)
    <6d2>   DW_AT_external    : 1
    <6d2>   DW_AT_name        : (indirect string, offset: 0x47d19): _txe_thread_create
    <6d6>   DW_AT_decl_file   : 4
    <6d6>   DW_AT_decl_line   : 1784
    <6d8>   DW_AT_decl_column : 13
    <6d8>   DW_AT_prototyped  : 1
    <6d8>   DW_AT_type        : <0xbc>
    <6dc>   DW_AT_declaration : 1
    <6dc>   DW_AT_sibling     : <0x718>
 <2><6e0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6e1>   DW_AT_type        : <0x556>
 <2><6e5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6e6>   DW_AT_type        : <0x169>
 <2><6ea>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6eb>   DW_AT_type        : <0x14e>
 <2><6ef>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6f0>   DW_AT_type        : <0xc8>
 <2><6f4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6f5>   DW_AT_type        : <0x9b>
 <2><6f9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6fa>   DW_AT_type        : <0xc8>
 <2><6fe>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6ff>   DW_AT_type        : <0xbc>
 <2><703>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <704>   DW_AT_type        : <0xbc>
 <2><708>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <709>   DW_AT_type        : <0xc8>
 <2><70d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <70e>   DW_AT_type        : <0xbc>
 <2><712>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <713>   DW_AT_type        : <0xbc>
 <2><717>: Abbrev Number: 0
 <1><718>: Abbrev Number: 24 (DW_TAG_subprogram)
    <719>   DW_AT_external    : 1
    <719>   DW_AT_name        : (indirect string, offset: 0x6925d): App_ThreadX_Init
    <71d>   DW_AT_decl_file   : 8
    <71e>   DW_AT_decl_line   : 63
    <71f>   DW_AT_decl_column : 6
    <720>   DW_AT_prototyped  : 1
    <720>   DW_AT_type        : <0xbc>
    <724>   DW_AT_declaration : 1
    <724>   DW_AT_sibling     : <0x72e>
 <2><728>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <729>   DW_AT_type        : <0x9b>
 <2><72d>: Abbrev Number: 0
 <1><72e>: Abbrev Number: 11 (DW_TAG_subprogram)
    <72f>   DW_AT_external    : 1
    <72f>   DW_AT_name        : (indirect string, offset: 0x63f11): _txe_byte_pool_create
    <733>   DW_AT_decl_file   : 4
    <733>   DW_AT_decl_line   : 1540
    <735>   DW_AT_decl_column : 13
    <735>   DW_AT_prototyped  : 1
    <735>   DW_AT_type        : <0xbc>
    <739>   DW_AT_declaration : 1
    <739>   DW_AT_sibling     : <0x757>
 <2><73d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <73e>   DW_AT_type        : <0x757>
 <2><742>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <743>   DW_AT_type        : <0x169>
 <2><747>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <748>   DW_AT_type        : <0x9b>
 <2><74c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <74d>   DW_AT_type        : <0xc8>
 <2><751>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <752>   DW_AT_type        : <0xbc>
 <2><756>: Abbrev Number: 0
 <1><757>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <758>   DW_AT_byte_size   : 4
    <758>   DW_AT_type        : <0x54a>
 <1><75c>: Abbrev Number: 11 (DW_TAG_subprogram)
    <75d>   DW_AT_external    : 1
    <75d>   DW_AT_name        : (indirect string, offset: 0x19665): _tx_thread_sleep
    <761>   DW_AT_decl_file   : 4
    <761>   DW_AT_decl_line   : 1773
    <763>   DW_AT_decl_column : 13
    <763>   DW_AT_prototyped  : 1
    <763>   DW_AT_type        : <0xbc>
    <767>   DW_AT_declaration : 1
    <767>   DW_AT_sibling     : <0x771>
 <2><76b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <76c>   DW_AT_type        : <0xc8>
 <2><770>: Abbrev Number: 0
 <1><771>: Abbrev Number: 25 (DW_TAG_subprogram)
    <772>   DW_AT_external    : 1
    <772>   DW_AT_name        : (indirect string, offset: 0x8a374): HAL_GPIO_WritePin
    <776>   DW_AT_decl_file   : 7
    <777>   DW_AT_decl_line   : 298
    <779>   DW_AT_decl_column : 19
    <77a>   DW_AT_prototyped  : 1
    <77a>   DW_AT_declaration : 1
    <77a>   DW_AT_sibling     : <0x78e>
 <2><77e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <77f>   DW_AT_type        : <0x78e>
 <2><783>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <784>   DW_AT_type        : <0x567>
 <2><788>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <789>   DW_AT_type        : <0x65d>
 <2><78d>: Abbrev Number: 0
 <1><78e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <78f>   DW_AT_byte_size   : 4
    <78f>   DW_AT_type        : <0x628>
 <1><793>: Abbrev Number: 26 (DW_TAG_subprogram)
    <794>   DW_AT_external    : 1
    <794>   DW_AT_name        : (indirect string, offset: 0xd09b1): tx_application_define
    <798>   DW_AT_decl_file   : 1
    <799>   DW_AT_decl_line   : 89
    <79a>   DW_AT_decl_column : 6
    <79b>   DW_AT_prototyped  : 1
    <79b>   DW_AT_low_pc      : 0x700008f8
    <79f>   DW_AT_high_pc     : 0x88
    <7a3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7a5>   DW_AT_call_all_tail_calls: 1
    <7a5>   DW_AT_sibling     : <0x7d4>
 <2><7a9>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <7aa>   DW_AT_name        : (indirect string, offset: 0x9045a): first_unused_memory
    <7ae>   DW_AT_decl_file   : 1
    <7ae>   DW_AT_decl_line   : 89
    <7af>   DW_AT_decl_column : 34
    <7b0>   DW_AT_type        : <0x9b>
    <7b4>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7b7>: Abbrev Number: 6 (DW_TAG_variable)
    <7b8>   DW_AT_name        : (indirect string, offset: 0x7b609): status
    <7bc>   DW_AT_decl_file   : 1
    <7bc>   DW_AT_decl_line   : 95
    <7bd>   DW_AT_decl_column : 8
    <7be>   DW_AT_type        : <0xbc>
    <7c2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7c5>: Abbrev Number: 6 (DW_TAG_variable)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x72ab2): memory_ptr
    <7ca>   DW_AT_decl_file   : 1
    <7ca>   DW_AT_decl_line   : 96
    <7cb>   DW_AT_decl_column : 9
    <7cc>   DW_AT_type        : <0x9b>
    <7d0>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><7d3>: Abbrev Number: 0
 <1><7d4>: Abbrev Number: 27 (DW_TAG_subprogram)
    <7d5>   DW_AT_name        : (indirect string, offset: 0x101e1e): led_thread_entry
    <7d9>   DW_AT_decl_file   : 1
    <7da>   DW_AT_decl_line   : 72
    <7db>   DW_AT_decl_column : 13
    <7dc>   DW_AT_prototyped  : 1
    <7dc>   DW_AT_low_pc      : 0x700008c4
    <7e0>   DW_AT_high_pc     : 0x34
    <7e4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7e6>   DW_AT_call_all_tail_calls: 1
 <2><7e6>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x11629d): param
    <7eb>   DW_AT_decl_file   : 1
    <7eb>   DW_AT_decl_line   : 72
    <7ec>   DW_AT_decl_column : 36
    <7ed>   DW_AT_type        : <0xc8>
    <7f1>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7f4>: Abbrev Number: 0
 <1><7f5>: Abbrev Number: 0
  Compilation Unit @ offset 0x7f6:
   Length:        0xd9 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x19f
   Pointer Size:  4
 <0><802>: Abbrev Number: 2 (DW_TAG_compile_unit)
    <803>   DW_AT_producer    : (indirect string, offset: 0x8cad5): GNU C11 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp.dp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <807>   DW_AT_language    : 29	(C11)
    <808>   DW_AT_name        : (indirect string, offset: 0x12ebd5): ../Core/Src/app_threadx.c
    <80c>   DW_AT_comp_dir    : (indirect string, offset: 0x118a9c): E:/2.Git/github/stm32h7r7_study/2.software/app/Appli/Debug
    <810>   DW_AT_ranges      : 0x26
    <814>   DW_AT_low_pc      : 0
    <818>   DW_AT_stmt_list   : 0xa0c
    <81c>   DW_AT_macros      : 0x2e3cc
 <1><820>: Abbrev Number: 1 (DW_TAG_base_type)
    <821>   DW_AT_byte_size   : 4
    <822>   DW_AT_encoding    : 7	(unsigned)
    <823>   DW_AT_name        : (indirect string, offset: 0x8cac8): unsigned int
 <1><827>: Abbrev Number: 3 (DW_TAG_base_type)
    <828>   DW_AT_byte_size   : 4
    <829>   DW_AT_encoding    : 5	(signed)
    <82a>   DW_AT_name        : int
 <1><82e>: Abbrev Number: 1 (DW_TAG_base_type)
    <82f>   DW_AT_byte_size   : 8
    <830>   DW_AT_encoding    : 5	(signed)
    <831>   DW_AT_name        : (indirect string, offset: 0x8e72): long long int
 <1><835>: Abbrev Number: 1 (DW_TAG_base_type)
    <836>   DW_AT_byte_size   : 8
    <837>   DW_AT_encoding    : 4	(float)
    <838>   DW_AT_name        : (indirect string, offset: 0xae207): long double
 <1><83c>: Abbrev Number: 1 (DW_TAG_base_type)
    <83d>   DW_AT_byte_size   : 1
    <83e>   DW_AT_encoding    : 6	(signed char)
    <83f>   DW_AT_name        : (indirect string, offset: 0x105b6b): signed char
 <1><843>: Abbrev Number: 1 (DW_TAG_base_type)
    <844>   DW_AT_byte_size   : 1
    <845>   DW_AT_encoding    : 8	(unsigned char)
    <846>   DW_AT_name        : (indirect string, offset: 0x989c1): unsigned char
 <1><84a>: Abbrev Number: 1 (DW_TAG_base_type)
    <84b>   DW_AT_byte_size   : 2
    <84c>   DW_AT_encoding    : 5	(signed)
    <84d>   DW_AT_name        : (indirect string, offset: 0x7ee55): short int
 <1><851>: Abbrev Number: 1 (DW_TAG_base_type)
    <852>   DW_AT_byte_size   : 2
    <853>   DW_AT_encoding    : 7	(unsigned)
    <854>   DW_AT_name        : (indirect string, offset: 0x55bbf): short unsigned int
 <1><858>: Abbrev Number: 1 (DW_TAG_base_type)
    <859>   DW_AT_byte_size   : 4
    <85a>   DW_AT_encoding    : 5	(signed)
    <85b>   DW_AT_name        : (indirect string, offset: 0x104dee): long int
 <1><85f>: Abbrev Number: 1 (DW_TAG_base_type)
    <860>   DW_AT_byte_size   : 4
    <861>   DW_AT_encoding    : 7	(unsigned)
    <862>   DW_AT_name        : (indirect string, offset: 0x8d172): long unsigned int
 <1><866>: Abbrev Number: 1 (DW_TAG_base_type)
    <867>   DW_AT_byte_size   : 8
    <868>   DW_AT_encoding    : 7	(unsigned)
    <869>   DW_AT_name        : (indirect string, offset: 0x9b484): long long unsigned int
 <1><86d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <86e>   DW_AT_byte_size   : 4
 <1><86f>: Abbrev Number: 1 (DW_TAG_base_type)
    <870>   DW_AT_byte_size   : 1
    <871>   DW_AT_encoding    : 8	(unsigned char)
    <872>   DW_AT_name        : (indirect string, offset: 0x105b72): char
 <1><876>: Abbrev Number: 5 (DW_TAG_typedef)
    <877>   DW_AT_name        : (indirect string, offset: 0xd4460): UINT
    <87b>   DW_AT_decl_file   : 2
    <87c>   DW_AT_decl_line   : 117
    <87d>   DW_AT_decl_column : 49
    <87e>   DW_AT_type        : <0x820>
 <1><882>: Abbrev Number: 6 (DW_TAG_subprogram)
    <883>   DW_AT_external    : 1
    <883>   DW_AT_name        : (indirect string, offset: 0x74edf): _tx_initialize_kernel_enter
    <887>   DW_AT_decl_file   : 3
    <888>   DW_AT_decl_line   : 1609
    <88a>   DW_AT_decl_column : 13
    <88b>   DW_AT_prototyped  : 1
    <88b>   DW_AT_declaration : 1
 <1><88b>: Abbrev Number: 7 (DW_TAG_subprogram)
    <88c>   DW_AT_external    : 1
    <88c>   DW_AT_name        : (indirect string, offset: 0x12ebef): MX_ThreadX_Init
    <890>   DW_AT_decl_file   : 1
    <891>   DW_AT_decl_line   : 78
    <892>   DW_AT_decl_column : 6
    <893>   DW_AT_prototyped  : 1
    <893>   DW_AT_low_pc      : 0x7000099a
    <897>   DW_AT_high_pc     : 0xc
    <89b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <89d>   DW_AT_call_all_tail_calls: 1
 <1><89d>: Abbrev Number: 8 (DW_TAG_subprogram)
    <89e>   DW_AT_external    : 1
    <89e>   DW_AT_name        : (indirect string, offset: 0x6925d): App_ThreadX_Init
    <8a2>   DW_AT_decl_file   : 1
    <8a3>   DW_AT_decl_line   : 59
    <8a4>   DW_AT_decl_column : 6
    <8a5>   DW_AT_prototyped  : 1
    <8a5>   DW_AT_type        : <0x876>
    <8a9>   DW_AT_low_pc      : 0x70000980
    <8ad>   DW_AT_high_pc     : 0x1a
    <8b1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8b3>   DW_AT_call_all_calls: 1
 <2><8b3>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <8b4>   DW_AT_name        : (indirect string, offset: 0x72ab2): memory_ptr
    <8b8>   DW_AT_decl_file   : 1
    <8b9>   DW_AT_decl_line   : 59
    <8ba>   DW_AT_decl_column : 29
    <8bb>   DW_AT_type        : <0x86d>
    <8bf>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8c2>: Abbrev Number: 10 (DW_TAG_variable)
    <8c3>   DW_AT_name        : ret
    <8c7>   DW_AT_decl_file   : 1
    <8c8>   DW_AT_decl_line   : 61
    <8c9>   DW_AT_decl_column : 8
    <8ca>   DW_AT_type        : <0x876>
    <8ce>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8d1>: Abbrev Number: 0
 <1><8d2>: Abbrev Number: 0
  Compilation Unit @ offset 0x8d3:
   Length:        0x9b (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x24a
   Pointer Size:  4
 <0><8df>: Abbrev Number: 2 (DW_TAG_compile_unit)
    <8e0>   DW_AT_producer    : (indirect string, offset: 0x8cad5): GNU C11 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp.dp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <8e4>   DW_AT_language    : 29	(C11)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x12ec1a): ../Core/Src/flash.c
    <8e9>   DW_AT_comp_dir    : (indirect string, offset: 0x118a9c): E:/2.Git/github/stm32h7r7_study/2.software/app/Appli/Debug
    <8ed>   DW_AT_ranges      : 0x3f
    <8f1>   DW_AT_low_pc      : 0
    <8f5>   DW_AT_stmt_list   : 0x1038
    <8f9>   DW_AT_macros      : 0x2e530
 <1><8fd>: Abbrev Number: 1 (DW_TAG_base_type)
    <8fe>   DW_AT_byte_size   : 2
    <8ff>   DW_AT_encoding    : 5	(signed)
    <900>   DW_AT_name        : (indirect string, offset: 0x7ee55): short int
 <1><904>: Abbrev Number: 1 (DW_TAG_base_type)
    <905>   DW_AT_byte_size   : 1
    <906>   DW_AT_encoding    : 6	(signed char)
    <907>   DW_AT_name        : (indirect string, offset: 0x105b6b): signed char
 <1><90b>: Abbrev Number: 1 (DW_TAG_base_type)
    <90c>   DW_AT_byte_size   : 1
    <90d>   DW_AT_encoding    : 8	(unsigned char)
    <90e>   DW_AT_name        : (indirect string, offset: 0x989c1): unsigned char
 <1><912>: Abbrev Number: 1 (DW_TAG_base_type)
    <913>   DW_AT_byte_size   : 2
    <914>   DW_AT_encoding    : 7	(unsigned)
    <915>   DW_AT_name        : (indirect string, offset: 0x55bbf): short unsigned int
 <1><919>: Abbrev Number: 1 (DW_TAG_base_type)
    <91a>   DW_AT_byte_size   : 4
    <91b>   DW_AT_encoding    : 5	(signed)
    <91c>   DW_AT_name        : (indirect string, offset: 0x104dee): long int
 <1><920>: Abbrev Number: 1 (DW_TAG_base_type)
    <921>   DW_AT_byte_size   : 4
    <922>   DW_AT_encoding    : 7	(unsigned)
    <923>   DW_AT_name        : (indirect string, offset: 0x8d172): long unsigned int
 <1><927>: Abbrev Number: 1 (DW_TAG_base_type)
    <928>   DW_AT_byte_size   : 8
    <929>   DW_AT_encoding    : 5	(signed)
    <92a>   DW_AT_name        : (indirect string, offset: 0x8e72): long long int
 <1><92e>: Abbrev Number: 1 (DW_TAG_base_type)
    <92f>   DW_AT_byte_size   : 8
    <930>   DW_AT_encoding    : 7	(unsigned)
    <931>   DW_AT_name        : (indirect string, offset: 0x9b484): long long unsigned int
 <1><935>: Abbrev Number: 3 (DW_TAG_base_type)
    <936>   DW_AT_byte_size   : 4
    <937>   DW_AT_encoding    : 5	(signed)
    <938>   DW_AT_name        : int
 <1><93c>: Abbrev Number: 1 (DW_TAG_base_type)
    <93d>   DW_AT_byte_size   : 4
    <93e>   DW_AT_encoding    : 7	(unsigned)
    <93f>   DW_AT_name        : (indirect string, offset: 0x8cac8): unsigned int
 <1><943>: Abbrev Number: 1 (DW_TAG_base_type)
    <944>   DW_AT_byte_size   : 8
    <945>   DW_AT_encoding    : 4	(float)
    <946>   DW_AT_name        : (indirect string, offset: 0xae207): long double
 <1><94a>: Abbrev Number: 1 (DW_TAG_base_type)
    <94b>   DW_AT_byte_size   : 1
    <94c>   DW_AT_encoding    : 8	(unsigned char)
    <94d>   DW_AT_name        : (indirect string, offset: 0x105b72): char
 <1><951>: Abbrev Number: 1 (DW_TAG_base_type)
    <952>   DW_AT_byte_size   : 4
    <953>   DW_AT_encoding    : 4	(float)
    <954>   DW_AT_name        : (indirect string, offset: 0x65eec): float
 <1><958>: Abbrev Number: 1 (DW_TAG_base_type)
    <959>   DW_AT_byte_size   : 8
    <95a>   DW_AT_encoding    : 4	(float)
    <95b>   DW_AT_name        : (indirect string, offset: 0x52c53): double
 <1><95f>: Abbrev Number: 4 (DW_TAG_subprogram)
    <960>   DW_AT_external    : 1
    <960>   DW_AT_name        : (indirect string, offset: 0x12ec0c): MX_FLASH_Init
    <964>   DW_AT_decl_file   : 1
    <965>   DW_AT_decl_line   : 28
    <966>   DW_AT_decl_column : 6
    <967>   DW_AT_prototyped  : 1
    <967>   DW_AT_low_pc      : 0x700009a6
    <96b>   DW_AT_high_pc     : 0xe
    <96f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <971>   DW_AT_call_all_calls: 1
 <1><971>: Abbrev Number: 0
  Compilation Unit @ offset 0x972:
   Length:        0x65f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x28f
   Pointer Size:  4
 <0><97e>: Abbrev Number: 16 (DW_TAG_compile_unit)
    <97f>   DW_AT_producer    : (indirect string, offset: 0x8cad5): GNU C11 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp.dp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <983>   DW_AT_language    : 29	(C11)
    <984>   DW_AT_name        : (indirect string, offset: 0x12eebd): ../Core/Src/gpio.c
    <988>   DW_AT_comp_dir    : (indirect string, offset: 0x118a9c): E:/2.Git/github/stm32h7r7_study/2.software/app/Appli/Debug
    <98c>   DW_AT_ranges      : 0x52
    <990>   DW_AT_low_pc      : 0
    <994>   DW_AT_stmt_list   : 0x18de
    <998>   DW_AT_macros      : 0x2eab7
 <1><99c>: Abbrev Number: 3 (DW_TAG_base_type)
    <99d>   DW_AT_byte_size   : 2
    <99e>   DW_AT_encoding    : 5	(signed)
    <99f>   DW_AT_name        : (indirect string, offset: 0x7ee55): short int
 <1><9a3>: Abbrev Number: 3 (DW_TAG_base_type)
    <9a4>   DW_AT_byte_size   : 1
    <9a5>   DW_AT_encoding    : 6	(signed char)
    <9a6>   DW_AT_name        : (indirect string, offset: 0x105b6b): signed char
 <1><9aa>: Abbrev Number: 3 (DW_TAG_base_type)
    <9ab>   DW_AT_byte_size   : 1
    <9ac>   DW_AT_encoding    : 8	(unsigned char)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x989c1): unsigned char
 <1><9b1>: Abbrev Number: 4 (DW_TAG_typedef)
    <9b2>   DW_AT_name        : (indirect string, offset: 0x5332): __uint16_t
    <9b6>   DW_AT_decl_file   : 2
    <9b7>   DW_AT_decl_line   : 57
    <9b8>   DW_AT_decl_column : 25
    <9b9>   DW_AT_type        : <0x9bd>
 <1><9bd>: Abbrev Number: 3 (DW_TAG_base_type)
    <9be>   DW_AT_byte_size   : 2
    <9bf>   DW_AT_encoding    : 7	(unsigned)
    <9c0>   DW_AT_name        : (indirect string, offset: 0x55bbf): short unsigned int
 <1><9c4>: Abbrev Number: 3 (DW_TAG_base_type)
    <9c5>   DW_AT_byte_size   : 4
    <9c6>   DW_AT_encoding    : 5	(signed)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x104dee): long int
 <1><9cb>: Abbrev Number: 4 (DW_TAG_typedef)
    <9cc>   DW_AT_name        : (indirect string, offset: 0xff4e): __uint32_t
    <9d0>   DW_AT_decl_file   : 2
    <9d1>   DW_AT_decl_line   : 79
    <9d2>   DW_AT_decl_column : 25
    <9d3>   DW_AT_type        : <0x9d7>
 <1><9d7>: Abbrev Number: 3 (DW_TAG_base_type)
    <9d8>   DW_AT_byte_size   : 4
    <9d9>   DW_AT_encoding    : 7	(unsigned)
    <9da>   DW_AT_name        : (indirect string, offset: 0x8d172): long unsigned int
 <1><9de>: Abbrev Number: 3 (DW_TAG_base_type)
    <9df>   DW_AT_byte_size   : 8
    <9e0>   DW_AT_encoding    : 5	(signed)
    <9e1>   DW_AT_name        : (indirect string, offset: 0x8e72): long long int
 <1><9e5>: Abbrev Number: 3 (DW_TAG_base_type)
    <9e6>   DW_AT_byte_size   : 8
    <9e7>   DW_AT_encoding    : 7	(unsigned)
    <9e8>   DW_AT_name        : (indirect string, offset: 0x9b484): long long unsigned int
 <1><9ec>: Abbrev Number: 17 (DW_TAG_base_type)
    <9ed>   DW_AT_byte_size   : 4
    <9ee>   DW_AT_encoding    : 5	(signed)
    <9ef>   DW_AT_name        : int
 <1><9f3>: Abbrev Number: 3 (DW_TAG_base_type)
    <9f4>   DW_AT_byte_size   : 4
    <9f5>   DW_AT_encoding    : 7	(unsigned)
    <9f6>   DW_AT_name        : (indirect string, offset: 0x8cac8): unsigned int
 <1><9fa>: Abbrev Number: 4 (DW_TAG_typedef)
    <9fb>   DW_AT_name        : (indirect string, offset: 0x5334): uint16_t
    <9ff>   DW_AT_decl_file   : 3
    <a00>   DW_AT_decl_line   : 36
    <a01>   DW_AT_decl_column : 20
    <a02>   DW_AT_type        : <0x9b1>
 <1><a06>: Abbrev Number: 4 (DW_TAG_typedef)
    <a07>   DW_AT_name        : (indirect string, offset: 0xff50): uint32_t
    <a0b>   DW_AT_decl_file   : 3
    <a0c>   DW_AT_decl_line   : 48
    <a0d>   DW_AT_decl_column : 20
    <a0e>   DW_AT_type        : <0x9cb>
 <1><a12>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <a13>   DW_AT_type        : <0xa06>
 <1><a17>: Abbrev Number: 6 (DW_TAG_array_type)
    <a18>   DW_AT_type        : <0xa06>
    <a1c>   DW_AT_sibling     : <0xa27>
 <2><a20>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a21>   DW_AT_type        : <0x9f3>
    <a25>   DW_AT_upper_bound : 1
 <2><a26>: Abbrev Number: 0
 <1><a27>: Abbrev Number: 6 (DW_TAG_array_type)
    <a28>   DW_AT_type        : <0xa06>
    <a2c>   DW_AT_sibling     : <0xa37>
 <2><a30>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a31>   DW_AT_type        : <0x9f3>
    <a35>   DW_AT_upper_bound : 2
 <2><a36>: Abbrev Number: 0
 <1><a37>: Abbrev Number: 6 (DW_TAG_array_type)
    <a38>   DW_AT_type        : <0xa12>
    <a3c>   DW_AT_sibling     : <0xa47>
 <2><a40>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a41>   DW_AT_type        : <0x9f3>
    <a45>   DW_AT_upper_bound : 1
 <2><a46>: Abbrev Number: 0
 <1><a47>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <a48>   DW_AT_type        : <0xa37>
 <1><a4c>: Abbrev Number: 6 (DW_TAG_array_type)
    <a4d>   DW_AT_type        : <0xa06>
    <a51>   DW_AT_sibling     : <0xa5c>
 <2><a55>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a56>   DW_AT_type        : <0x9f3>
    <a5a>   DW_AT_upper_bound : 9
 <2><a5b>: Abbrev Number: 0
 <1><a5c>: Abbrev Number: 6 (DW_TAG_array_type)
    <a5d>   DW_AT_type        : <0xa06>
    <a61>   DW_AT_sibling     : <0xa6c>
 <2><a65>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a66>   DW_AT_type        : <0x9f3>
    <a6a>   DW_AT_upper_bound : 10
 <2><a6b>: Abbrev Number: 0
 <1><a6c>: Abbrev Number: 18 (DW_TAG_structure_type)
    <a6d>   DW_AT_byte_size   : 44
    <a6e>   DW_AT_decl_file   : 4
    <a6f>   DW_AT_decl_line   : 963
    <a71>   DW_AT_decl_column : 9
    <a72>   DW_AT_sibling     : <0xaef>
 <2><a76>: Abbrev Number: 1 (DW_TAG_member)
    <a77>   DW_AT_name        : (indirect string, offset: 0x11953d): MODER
    <a7b>   DW_AT_decl_file   : 4
    <a7b>   DW_AT_decl_line   : 965
    <a7d>   DW_AT_decl_column : 17
    <a7d>   DW_AT_type        : <0xa12>
    <a81>   DW_AT_data_member_location: 0
 <2><a82>: Abbrev Number: 1 (DW_TAG_member)
    <a83>   DW_AT_name        : (indirect string, offset: 0x1099e9): OTYPER
    <a87>   DW_AT_decl_file   : 4
    <a87>   DW_AT_decl_line   : 966
    <a89>   DW_AT_decl_column : 17
    <a89>   DW_AT_type        : <0xa12>
    <a8d>   DW_AT_data_member_location: 4
 <2><a8e>: Abbrev Number: 1 (DW_TAG_member)
    <a8f>   DW_AT_name        : (indirect string, offset: 0xddbea): OSPEEDR
    <a93>   DW_AT_decl_file   : 4
    <a93>   DW_AT_decl_line   : 967
    <a95>   DW_AT_decl_column : 17
    <a95>   DW_AT_type        : <0xa12>
    <a99>   DW_AT_data_member_location: 8
 <2><a9a>: Abbrev Number: 1 (DW_TAG_member)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x11f4ed): PUPDR
    <a9f>   DW_AT_decl_file   : 4
    <a9f>   DW_AT_decl_line   : 968
    <aa1>   DW_AT_decl_column : 17
    <aa1>   DW_AT_type        : <0xa12>
    <aa5>   DW_AT_data_member_location: 12
 <2><aa6>: Abbrev Number: 5 (DW_TAG_member)
    <aa7>   DW_AT_name        : IDR
    <aab>   DW_AT_decl_file   : 4
    <aab>   DW_AT_decl_line   : 969
    <aad>   DW_AT_decl_column : 17
    <aad>   DW_AT_type        : <0xa12>
    <ab1>   DW_AT_data_member_location: 16
 <2><ab2>: Abbrev Number: 5 (DW_TAG_member)
    <ab3>   DW_AT_name        : ODR
    <ab7>   DW_AT_decl_file   : 4
    <ab7>   DW_AT_decl_line   : 970
    <ab9>   DW_AT_decl_column : 17
    <ab9>   DW_AT_type        : <0xa12>
    <abd>   DW_AT_data_member_location: 20
 <2><abe>: Abbrev Number: 1 (DW_TAG_member)
    <abf>   DW_AT_name        : (indirect string, offset: 0x33728): BSRR
    <ac3>   DW_AT_decl_file   : 4
    <ac3>   DW_AT_decl_line   : 971
    <ac5>   DW_AT_decl_column : 17
    <ac5>   DW_AT_type        : <0xa12>
    <ac9>   DW_AT_data_member_location: 24
 <2><aca>: Abbrev Number: 1 (DW_TAG_member)
    <acb>   DW_AT_name        : (indirect string, offset: 0x125da0): LCKR
    <acf>   DW_AT_decl_file   : 4
    <acf>   DW_AT_decl_line   : 972
    <ad1>   DW_AT_decl_column : 17
    <ad1>   DW_AT_type        : <0xa12>
    <ad5>   DW_AT_data_member_location: 28
 <2><ad6>: Abbrev Number: 5 (DW_TAG_member)
    <ad7>   DW_AT_name        : AFR
    <adb>   DW_AT_decl_file   : 4
    <adb>   DW_AT_decl_line   : 973
    <add>   DW_AT_decl_column : 17
    <add>   DW_AT_type        : <0xa47>
    <ae1>   DW_AT_data_member_location: 32
 <2><ae2>: Abbrev Number: 5 (DW_TAG_member)
    <ae3>   DW_AT_name        : BRR
    <ae7>   DW_AT_decl_file   : 4
    <ae7>   DW_AT_decl_line   : 974
    <ae9>   DW_AT_decl_column : 17
    <ae9>   DW_AT_type        : <0xa12>
    <aed>   DW_AT_data_member_location: 40
 <2><aee>: Abbrev Number: 0
 <1><aef>: Abbrev Number: 12 (DW_TAG_typedef)
    <af0>   DW_AT_name        : (indirect string, offset: 0x867dc): GPIO_TypeDef
    <af4>   DW_AT_decl_file   : 4
    <af4>   DW_AT_decl_line   : 975
    <af6>   DW_AT_decl_column : 3
    <af6>   DW_AT_type        : <0xa6c>
 <1><afa>: Abbrev Number: 19 (DW_TAG_structure_type)
    <afb>   DW_AT_byte_size   : 388
    <afd>   DW_AT_decl_file   : 4
    <afe>   DW_AT_decl_line   : 1479
    <b00>   DW_AT_decl_column : 9
    <b01>   DW_AT_sibling     : <0xea2>
 <2><b05>: Abbrev Number: 5 (DW_TAG_member)
    <b06>   DW_AT_name        : CR
    <b09>   DW_AT_decl_file   : 4
    <b09>   DW_AT_decl_line   : 1481
    <b0b>   DW_AT_decl_column : 17
    <b0b>   DW_AT_type        : <0xa12>
    <b0f>   DW_AT_data_member_location: 0
 <2><b10>: Abbrev Number: 1 (DW_TAG_member)
    <b11>   DW_AT_name        : (indirect string, offset: 0x12eea3): HSICFGR
    <b15>   DW_AT_decl_file   : 4
    <b15>   DW_AT_decl_line   : 1482
    <b17>   DW_AT_decl_column : 17
    <b17>   DW_AT_type        : <0xa12>
    <b1b>   DW_AT_data_member_location: 4
 <2><b1c>: Abbrev Number: 1 (DW_TAG_member)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x12ec9a): CRRCR
    <b21>   DW_AT_decl_file   : 4
    <b21>   DW_AT_decl_line   : 1483
    <b23>   DW_AT_decl_column : 17
    <b23>   DW_AT_type        : <0xa12>
    <b27>   DW_AT_data_member_location: 8
 <2><b28>: Abbrev Number: 1 (DW_TAG_member)
    <b29>   DW_AT_name        : (indirect string, offset: 0x12ee1a): CSICFGR
    <b2d>   DW_AT_decl_file   : 4
    <b2d>   DW_AT_decl_line   : 1484
    <b2f>   DW_AT_decl_column : 17
    <b2f>   DW_AT_type        : <0xa12>
    <b33>   DW_AT_data_member_location: 12
 <2><b34>: Abbrev Number: 1 (DW_TAG_member)
    <b35>   DW_AT_name        : (indirect string, offset: 0x12ec90): CFGR
    <b39>   DW_AT_decl_file   : 4
    <b39>   DW_AT_decl_line   : 1485
    <b3b>   DW_AT_decl_column : 17
    <b3b>   DW_AT_type        : <0xa12>
    <b3f>   DW_AT_data_member_location: 16
 <2><b40>: Abbrev Number: 1 (DW_TAG_member)
    <b41>   DW_AT_name        : (indirect string, offset: 0x12ed36): RESERVED0
    <b45>   DW_AT_decl_file   : 4
    <b45>   DW_AT_decl_line   : 1486
    <b47>   DW_AT_decl_column : 17
    <b47>   DW_AT_type        : <0xa06>
    <b4b>   DW_AT_data_member_location: 20
 <2><b4c>: Abbrev Number: 1 (DW_TAG_member)
    <b4d>   DW_AT_name        : (indirect string, offset: 0x12eed0): CDCFGR
    <b51>   DW_AT_decl_file   : 4
    <b51>   DW_AT_decl_line   : 1487
    <b53>   DW_AT_decl_column : 17
    <b53>   DW_AT_type        : <0xa12>
    <b57>   DW_AT_data_member_location: 24
 <2><b58>: Abbrev Number: 1 (DW_TAG_member)
    <b59>   DW_AT_name        : (indirect string, offset: 0x12eddb): BMCFGR
    <b5d>   DW_AT_decl_file   : 4
    <b5d>   DW_AT_decl_line   : 1488
    <b5f>   DW_AT_decl_column : 17
    <b5f>   DW_AT_type        : <0xa12>
    <b63>   DW_AT_data_member_location: 28
 <2><b64>: Abbrev Number: 1 (DW_TAG_member)
    <b65>   DW_AT_name        : (indirect string, offset: 0x12ec8d): APBCFGR
    <b69>   DW_AT_decl_file   : 4
    <b69>   DW_AT_decl_line   : 1489
    <b6b>   DW_AT_decl_column : 17
    <b6b>   DW_AT_type        : <0xa12>
    <b6f>   DW_AT_data_member_location: 32
 <2><b70>: Abbrev Number: 1 (DW_TAG_member)
    <b71>   DW_AT_name        : (indirect string, offset: 0x12ed40): RESERVED1
    <b75>   DW_AT_decl_file   : 4
    <b75>   DW_AT_decl_line   : 1490
    <b77>   DW_AT_decl_column : 17
    <b77>   DW_AT_type        : <0xa06>
    <b7b>   DW_AT_data_member_location: 36
 <2><b7c>: Abbrev Number: 1 (DW_TAG_member)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x12ec35): PLLCKSELR
    <b81>   DW_AT_decl_file   : 4
    <b81>   DW_AT_decl_line   : 1491
    <b83>   DW_AT_decl_column : 17
    <b83>   DW_AT_type        : <0xa12>
    <b87>   DW_AT_data_member_location: 40
 <2><b88>: Abbrev Number: 1 (DW_TAG_member)
    <b89>   DW_AT_name        : (indirect string, offset: 0x12ec7d): PLLCFGR
    <b8d>   DW_AT_decl_file   : 4
    <b8d>   DW_AT_decl_line   : 1492
    <b8f>   DW_AT_decl_column : 17
    <b8f>   DW_AT_type        : <0xa12>
    <b93>   DW_AT_data_member_location: 44
 <2><b94>: Abbrev Number: 1 (DW_TAG_member)
    <b95>   DW_AT_name        : (indirect string, offset: 0x12ee7d): PLL1DIVR1
    <b99>   DW_AT_decl_file   : 4
    <b99>   DW_AT_decl_line   : 1493
    <b9b>   DW_AT_decl_column : 17
    <b9b>   DW_AT_type        : <0xa12>
    <b9f>   DW_AT_data_member_location: 48
 <2><ba0>: Abbrev Number: 1 (DW_TAG_member)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x12ee42): PLL1FRACR
    <ba5>   DW_AT_decl_file   : 4
    <ba5>   DW_AT_decl_line   : 1494
    <ba7>   DW_AT_decl_column : 17
    <ba7>   DW_AT_type        : <0xa12>
    <bab>   DW_AT_data_member_location: 52
 <2><bac>: Abbrev Number: 1 (DW_TAG_member)
    <bad>   DW_AT_name        : (indirect string, offset: 0x12ee69): PLL2DIVR1
    <bb1>   DW_AT_decl_file   : 4
    <bb1>   DW_AT_decl_line   : 1495
    <bb3>   DW_AT_decl_column : 17
    <bb3>   DW_AT_type        : <0xa12>
    <bb7>   DW_AT_data_member_location: 56
 <2><bb8>: Abbrev Number: 1 (DW_TAG_member)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x12ee2c): PLL2FRACR
    <bbd>   DW_AT_decl_file   : 4
    <bbd>   DW_AT_decl_line   : 1496
    <bbf>   DW_AT_decl_column : 17
    <bbf>   DW_AT_type        : <0xa12>
    <bc3>   DW_AT_data_member_location: 60
 <2><bc4>: Abbrev Number: 1 (DW_TAG_member)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x12ee4c): PLL3DIVR1
    <bc9>   DW_AT_decl_file   : 4
    <bc9>   DW_AT_decl_line   : 1497
    <bcb>   DW_AT_decl_column : 17
    <bcb>   DW_AT_type        : <0xa12>
    <bcf>   DW_AT_data_member_location: 64
 <2><bd0>: Abbrev Number: 1 (DW_TAG_member)
    <bd1>   DW_AT_name        : (indirect string, offset: 0x12ee22): PLL3FRACR
    <bd5>   DW_AT_decl_file   : 4
    <bd5>   DW_AT_decl_line   : 1498
    <bd7>   DW_AT_decl_column : 17
    <bd7>   DW_AT_type        : <0xa12>
    <bdb>   DW_AT_data_member_location: 68
 <2><bdc>: Abbrev Number: 1 (DW_TAG_member)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x12edfc): RESERVED2
    <be1>   DW_AT_decl_file   : 4
    <be1>   DW_AT_decl_line   : 1499
    <be3>   DW_AT_decl_column : 17
    <be3>   DW_AT_type        : <0xa06>
    <be7>   DW_AT_data_member_location: 72
 <2><be8>: Abbrev Number: 1 (DW_TAG_member)
    <be9>   DW_AT_name        : (indirect string, offset: 0x12ecc4): CCIPR1
    <bed>   DW_AT_decl_file   : 4
    <bed>   DW_AT_decl_line   : 1500
    <bef>   DW_AT_decl_column : 17
    <bef>   DW_AT_type        : <0xa12>
    <bf3>   DW_AT_data_member_location: 76
 <2><bf4>: Abbrev Number: 1 (DW_TAG_member)
    <bf5>   DW_AT_name        : (indirect string, offset: 0x12eccb): CCIPR2
    <bf9>   DW_AT_decl_file   : 4
    <bf9>   DW_AT_decl_line   : 1501
    <bfb>   DW_AT_decl_column : 17
    <bfb>   DW_AT_type        : <0xa12>
    <bff>   DW_AT_data_member_location: 80
 <2><c00>: Abbrev Number: 1 (DW_TAG_member)
    <c01>   DW_AT_name        : (indirect string, offset: 0x12ecd2): CCIPR3
    <c05>   DW_AT_decl_file   : 4
    <c05>   DW_AT_decl_line   : 1502
    <c07>   DW_AT_decl_column : 17
    <c07>   DW_AT_type        : <0xa12>
    <c0b>   DW_AT_data_member_location: 84
 <2><c0c>: Abbrev Number: 1 (DW_TAG_member)
    <c0d>   DW_AT_name        : (indirect string, offset: 0x12ec2e): CCIPR4
    <c11>   DW_AT_decl_file   : 4
    <c11>   DW_AT_decl_line   : 1503
    <c13>   DW_AT_decl_column : 17
    <c13>   DW_AT_type        : <0xa12>
    <c17>   DW_AT_data_member_location: 88
 <2><c18>: Abbrev Number: 1 (DW_TAG_member)
    <c19>   DW_AT_name        : (indirect string, offset: 0x12ed4a): RESERVED3
    <c1d>   DW_AT_decl_file   : 4
    <c1d>   DW_AT_decl_line   : 1504
    <c1f>   DW_AT_decl_column : 17
    <c1f>   DW_AT_type        : <0xa06>
    <c23>   DW_AT_data_member_location: 92
 <2><c24>: Abbrev Number: 1 (DW_TAG_member)
    <c25>   DW_AT_name        : (indirect string, offset: 0x12ec6b): CIER
    <c29>   DW_AT_decl_file   : 4
    <c29>   DW_AT_decl_line   : 1505
    <c2b>   DW_AT_decl_column : 17
    <c2b>   DW_AT_type        : <0xa12>
    <c2f>   DW_AT_data_member_location: 96
 <2><c30>: Abbrev Number: 1 (DW_TAG_member)
    <c31>   DW_AT_name        : (indirect string, offset: 0x12ec70): CIFR
    <c35>   DW_AT_decl_file   : 4
    <c35>   DW_AT_decl_line   : 1506
    <c37>   DW_AT_decl_column : 17
    <c37>   DW_AT_type        : <0xa12>
    <c3b>   DW_AT_data_member_location: 100
 <2><c3c>: Abbrev Number: 1 (DW_TAG_member)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x12ec66): CICR
    <c41>   DW_AT_decl_file   : 4
    <c41>   DW_AT_decl_line   : 1507
    <c43>   DW_AT_decl_column : 17
    <c43>   DW_AT_type        : <0xa12>
    <c47>   DW_AT_data_member_location: 104
 <2><c48>: Abbrev Number: 1 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0x12ed54): RESERVED4
    <c4d>   DW_AT_decl_file   : 4
    <c4d>   DW_AT_decl_line   : 1508
    <c4f>   DW_AT_decl_column : 17
    <c4f>   DW_AT_type        : <0xa06>
    <c53>   DW_AT_data_member_location: 108
 <2><c54>: Abbrev Number: 1 (DW_TAG_member)
    <c55>   DW_AT_name        : (indirect string, offset: 0x12ec95): BDCR
    <c59>   DW_AT_decl_file   : 4
    <c59>   DW_AT_decl_line   : 1509
    <c5b>   DW_AT_decl_column : 17
    <c5b>   DW_AT_type        : <0xa12>
    <c5f>   DW_AT_data_member_location: 112
 <2><c60>: Abbrev Number: 5 (DW_TAG_member)
    <c61>   DW_AT_name        : CSR
    <c65>   DW_AT_decl_file   : 4
    <c65>   DW_AT_decl_line   : 1510
    <c67>   DW_AT_decl_column : 17
    <c67>   DW_AT_type        : <0xa12>
    <c6b>   DW_AT_data_member_location: 116
 <2><c6c>: Abbrev Number: 1 (DW_TAG_member)
    <c6d>   DW_AT_name        : (indirect string, offset: 0x12ed5e): RESERVED5
    <c71>   DW_AT_decl_file   : 4
    <c71>   DW_AT_decl_line   : 1511
    <c73>   DW_AT_decl_column : 17
    <c73>   DW_AT_type        : <0xa06>
    <c77>   DW_AT_data_member_location: 120
 <2><c78>: Abbrev Number: 1 (DW_TAG_member)
    <c79>   DW_AT_name        : (indirect string, offset: 0x12eca0): AHB5RSTR
    <c7d>   DW_AT_decl_file   : 4
    <c7d>   DW_AT_decl_line   : 1512
    <c7f>   DW_AT_decl_column : 17
    <c7f>   DW_AT_type        : <0xa12>
    <c83>   DW_AT_data_member_location: 124
 <2><c84>: Abbrev Number: 1 (DW_TAG_member)
    <c85>   DW_AT_name        : (indirect string, offset: 0x12eef2): AHB1RSTR
    <c89>   DW_AT_decl_file   : 4
    <c89>   DW_AT_decl_line   : 1513
    <c8b>   DW_AT_decl_column : 17
    <c8b>   DW_AT_type        : <0xa12>
    <c8f>   DW_AT_data_member_location: 128
 <2><c90>: Abbrev Number: 1 (DW_TAG_member)
    <c91>   DW_AT_name        : (indirect string, offset: 0x12ede2): AHB2RSTR
    <c95>   DW_AT_decl_file   : 4
    <c95>   DW_AT_decl_line   : 1514
    <c97>   DW_AT_decl_column : 17
    <c97>   DW_AT_type        : <0xa12>
    <c9b>   DW_AT_data_member_location: 132
 <2><c9c>: Abbrev Number: 1 (DW_TAG_member)
    <c9d>   DW_AT_name        : (indirect string, offset: 0x12ee60): AHB4RSTR
    <ca1>   DW_AT_decl_file   : 4
    <ca1>   DW_AT_decl_line   : 1515
    <ca3>   DW_AT_decl_column : 17
    <ca3>   DW_AT_type        : <0xa12>
    <ca7>   DW_AT_data_member_location: 136
 <2><ca8>: Abbrev Number: 1 (DW_TAG_member)
    <ca9>   DW_AT_name        : (indirect string, offset: 0x12edeb): APB5RSTR
    <cad>   DW_AT_decl_file   : 4
    <cad>   DW_AT_decl_line   : 1516
    <caf>   DW_AT_decl_column : 17
    <caf>   DW_AT_type        : <0xa12>
    <cb3>   DW_AT_data_member_location: 140
 <2><cb4>: Abbrev Number: 1 (DW_TAG_member)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x12ed9f): APB1RSTR1
    <cb9>   DW_AT_decl_file   : 4
    <cb9>   DW_AT_decl_line   : 1517
    <cbb>   DW_AT_decl_column : 17
    <cbb>   DW_AT_type        : <0xa12>
    <cbf>   DW_AT_data_member_location: 144
 <2><cc0>: Abbrev Number: 1 (DW_TAG_member)
    <cc1>   DW_AT_name        : (indirect string, offset: 0x12ee91): APB1RSTR2
    <cc5>   DW_AT_decl_file   : 4
    <cc5>   DW_AT_decl_line   : 1518
    <cc7>   DW_AT_decl_column : 17
    <cc7>   DW_AT_type        : <0xa12>
    <ccb>   DW_AT_data_member_location: 148
 <2><ccc>: Abbrev Number: 1 (DW_TAG_member)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x12eee1): APB2RSTR
    <cd1>   DW_AT_decl_file   : 4
    <cd1>   DW_AT_decl_line   : 1519
    <cd3>   DW_AT_decl_column : 17
    <cd3>   DW_AT_type        : <0xa12>
    <cd7>   DW_AT_data_member_location: 152
 <2><cd8>: Abbrev Number: 1 (DW_TAG_member)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x12ef06): APB4RSTR
    <cdd>   DW_AT_decl_file   : 4
    <cdd>   DW_AT_decl_line   : 1520
    <cdf>   DW_AT_decl_column : 17
    <cdf>   DW_AT_type        : <0xa12>
    <ce3>   DW_AT_data_member_location: 156
 <2><ce4>: Abbrev Number: 1 (DW_TAG_member)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x12ed68): RESERVED6
    <ce9>   DW_AT_decl_file   : 4
    <ce9>   DW_AT_decl_line   : 1521
    <ceb>   DW_AT_decl_column : 17
    <ceb>   DW_AT_type        : <0xa06>
    <cef>   DW_AT_data_member_location: 160
 <2><cf0>: Abbrev Number: 1 (DW_TAG_member)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x12ec4d): AHB3RSTR
    <cf5>   DW_AT_decl_file   : 4
    <cf5>   DW_AT_decl_line   : 1522
    <cf7>   DW_AT_decl_column : 17
    <cf7>   DW_AT_type        : <0xa12>
    <cfb>   DW_AT_data_member_location: 164
 <2><cfc>: Abbrev Number: 1 (DW_TAG_member)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x12ee06): RESERVED7
    <d01>   DW_AT_decl_file   : 4
    <d01>   DW_AT_decl_line   : 1523
    <d03>   DW_AT_decl_column : 17
    <d03>   DW_AT_type        : <0xa17>
    <d07>   DW_AT_data_member_location: 168
 <2><d08>: Abbrev Number: 1 (DW_TAG_member)
    <d09>   DW_AT_name        : (indirect string, offset: 0x12ed86): CKGDISR
    <d0d>   DW_AT_decl_file   : 4
    <d0d>   DW_AT_decl_line   : 1524
    <d0f>   DW_AT_decl_column : 17
    <d0f>   DW_AT_type        : <0xa12>
    <d13>   DW_AT_data_member_location: 176
 <2><d14>: Abbrev Number: 1 (DW_TAG_member)
    <d15>   DW_AT_name        : (indirect string, offset: 0x12ee10): RESERVED8
    <d19>   DW_AT_decl_file   : 4
    <d19>   DW_AT_decl_line   : 1525
    <d1b>   DW_AT_decl_column : 17
    <d1b>   DW_AT_type        : <0xa27>
    <d1f>   DW_AT_data_member_location: 180
 <2><d20>: Abbrev Number: 1 (DW_TAG_member)
    <d21>   DW_AT_name        : (indirect string, offset: 0x12ee87): PLL1DIVR2
    <d25>   DW_AT_decl_file   : 4
    <d25>   DW_AT_decl_line   : 1526
    <d27>   DW_AT_decl_column : 17
    <d27>   DW_AT_type        : <0xa12>
    <d2b>   DW_AT_data_member_location: 192
 <2><d2c>: Abbrev Number: 1 (DW_TAG_member)
    <d2d>   DW_AT_name        : (indirect string, offset: 0x12ee73): PLL2DIVR2
    <d31>   DW_AT_decl_file   : 4
    <d31>   DW_AT_decl_line   : 1527
    <d33>   DW_AT_decl_column : 17
    <d33>   DW_AT_type        : <0xa12>
    <d37>   DW_AT_data_member_location: 196
 <2><d38>: Abbrev Number: 1 (DW_TAG_member)
    <d39>   DW_AT_name        : (indirect string, offset: 0x12ee56): PLL3DIVR2
    <d3d>   DW_AT_decl_file   : 4
    <d3d>   DW_AT_decl_line   : 1528
    <d3f>   DW_AT_decl_column : 17
    <d3f>   DW_AT_type        : <0xa12>
    <d43>   DW_AT_data_member_location: 200
 <2><d44>: Abbrev Number: 1 (DW_TAG_member)
    <d45>   DW_AT_name        : (indirect string, offset: 0x12edd1): PLL1SSCGR
    <d49>   DW_AT_decl_file   : 4
    <d49>   DW_AT_decl_line   : 1529
    <d4b>   DW_AT_decl_column : 17
    <d4b>   DW_AT_type        : <0xa12>
    <d4f>   DW_AT_data_member_location: 204
 <2><d50>: Abbrev Number: 1 (DW_TAG_member)
    <d51>   DW_AT_name        : (indirect string, offset: 0x12eeab): PLL2SSCGR
    <d55>   DW_AT_decl_file   : 4
    <d55>   DW_AT_decl_line   : 1530
    <d57>   DW_AT_decl_column : 17
    <d57>   DW_AT_type        : <0xa12>
    <d5b>   DW_AT_data_member_location: 208
 <2><d5c>: Abbrev Number: 1 (DW_TAG_member)
    <d5d>   DW_AT_name        : (indirect string, offset: 0x12edc7): PLL3SSCGR
    <d61>   DW_AT_decl_file   : 4
    <d61>   DW_AT_decl_line   : 1531
    <d63>   DW_AT_decl_column : 17
    <d63>   DW_AT_type        : <0xa12>
    <d67>   DW_AT_data_member_location: 212
 <2><d68>: Abbrev Number: 1 (DW_TAG_member)
    <d69>   DW_AT_name        : (indirect string, offset: 0x12ed72): RESERVED9
    <d6d>   DW_AT_decl_file   : 4
    <d6d>   DW_AT_decl_line   : 1532
    <d6f>   DW_AT_decl_column : 17
    <d6f>   DW_AT_type        : <0xa4c>
    <d73>   DW_AT_data_member_location: 216
 <2><d74>: Abbrev Number: 2 (DW_TAG_member)
    <d75>   DW_AT_name        : (indirect string, offset: 0x12ec75): CKPROTR
    <d79>   DW_AT_decl_file   : 4
    <d79>   DW_AT_decl_line   : 1533
    <d7b>   DW_AT_decl_column : 17
    <d7b>   DW_AT_type        : <0xa12>
    <d7f>   DW_AT_data_member_location: 256
 <2><d81>: Abbrev Number: 2 (DW_TAG_member)
    <d82>   DW_AT_name        : (indirect string, offset: 0x12eefb): RESERVED10
    <d86>   DW_AT_decl_file   : 4
    <d86>   DW_AT_decl_line   : 1534
    <d88>   DW_AT_decl_column : 17
    <d88>   DW_AT_type        : <0xa5c>
    <d8c>   DW_AT_data_member_location: 260
 <2><d8e>: Abbrev Number: 20 (DW_TAG_member)
    <d8f>   DW_AT_name        : RSR
    <d93>   DW_AT_decl_file   : 4
    <d94>   DW_AT_decl_line   : 1535
    <d96>   DW_AT_decl_column : 17
    <d97>   DW_AT_type        : <0xa12>
    <d9b>   DW_AT_data_member_location: 304
 <2><d9d>: Abbrev Number: 2 (DW_TAG_member)
    <d9e>   DW_AT_name        : (indirect string, offset: 0x12eeea): AHB5ENR
    <da2>   DW_AT_decl_file   : 4
    <da2>   DW_AT_decl_line   : 1536
    <da4>   DW_AT_decl_column : 17
    <da4>   DW_AT_type        : <0xa12>
    <da8>   DW_AT_data_member_location: 308
 <2><daa>: Abbrev Number: 2 (DW_TAG_member)
    <dab>   DW_AT_name        : (indirect string, offset: 0x12edf4): AHB1ENR
    <daf>   DW_AT_decl_file   : 4
    <daf>   DW_AT_decl_line   : 1537
    <db1>   DW_AT_decl_column : 17
    <db1>   DW_AT_type        : <0xa12>
    <db5>   DW_AT_data_member_location: 312
 <2><db7>: Abbrev Number: 2 (DW_TAG_member)
    <db8>   DW_AT_name        : (indirect string, offset: 0x12ec85): AHB2ENR
    <dbc>   DW_AT_decl_file   : 4
    <dbc>   DW_AT_decl_line   : 1538
    <dbe>   DW_AT_decl_column : 17
    <dbe>   DW_AT_type        : <0xa12>
    <dc2>   DW_AT_data_member_location: 316
 <2><dc4>: Abbrev Number: 2 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x12edbf): AHB4ENR
    <dc9>   DW_AT_decl_file   : 4
    <dc9>   DW_AT_decl_line   : 1539
    <dcb>   DW_AT_decl_column : 17
    <dcb>   DW_AT_type        : <0xa12>
    <dcf>   DW_AT_data_member_location: 320
 <2><dd1>: Abbrev Number: 2 (DW_TAG_member)
    <dd2>   DW_AT_name        : (indirect string, offset: 0x12eeb5): APB5ENR
    <dd6>   DW_AT_decl_file   : 4
    <dd6>   DW_AT_decl_line   : 1540
    <dd8>   DW_AT_decl_column : 17
    <dd8>   DW_AT_type        : <0xa12>
    <ddc>   DW_AT_data_member_location: 324
 <2><dde>: Abbrev Number: 2 (DW_TAG_member)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x12ed06): APB1ENR1
    <de3>   DW_AT_decl_file   : 4
    <de3>   DW_AT_decl_line   : 1541
    <de5>   DW_AT_decl_column : 17
    <de5>   DW_AT_type        : <0xa12>
    <de9>   DW_AT_data_member_location: 328
 <2><deb>: Abbrev Number: 2 (DW_TAG_member)
    <dec>   DW_AT_name        : (indirect string, offset: 0x12ed0f): APB1ENR2
    <df0>   DW_AT_decl_file   : 4
    <df0>   DW_AT_decl_line   : 1542
    <df2>   DW_AT_decl_column : 17
    <df2>   DW_AT_type        : <0xa12>
    <df6>   DW_AT_data_member_location: 332
 <2><df8>: Abbrev Number: 2 (DW_TAG_member)
    <df9>   DW_AT_name        : (indirect string, offset: 0x12ec3f): APB2ENR
    <dfd>   DW_AT_decl_file   : 4
    <dfd>   DW_AT_decl_line   : 1543
    <dff>   DW_AT_decl_column : 17
    <dff>   DW_AT_type        : <0xa12>
    <e03>   DW_AT_data_member_location: 336
 <2><e05>: Abbrev Number: 2 (DW_TAG_member)
    <e06>   DW_AT_name        : (indirect string, offset: 0x12ecd9): APB4ENR
    <e0a>   DW_AT_decl_file   : 4
    <e0a>   DW_AT_decl_line   : 1544
    <e0c>   DW_AT_decl_column : 17
    <e0c>   DW_AT_type        : <0xa12>
    <e10>   DW_AT_data_member_location: 340
 <2><e12>: Abbrev Number: 2 (DW_TAG_member)
    <e13>   DW_AT_name        : (indirect string, offset: 0x12ee9b): AHB3ENR
    <e17>   DW_AT_decl_file   : 4
    <e17>   DW_AT_decl_line   : 1545
    <e19>   DW_AT_decl_column : 17
    <e19>   DW_AT_type        : <0xa12>
    <e1d>   DW_AT_data_member_location: 344
 <2><e1f>: Abbrev Number: 2 (DW_TAG_member)
    <e20>   DW_AT_name        : (indirect string, offset: 0x12ecfc): AHB5LPENR
    <e24>   DW_AT_decl_file   : 4
    <e24>   DW_AT_decl_line   : 1546
    <e26>   DW_AT_decl_column : 17
    <e26>   DW_AT_type        : <0xa12>
    <e2a>   DW_AT_data_member_location: 348
 <2><e2c>: Abbrev Number: 2 (DW_TAG_member)
    <e2d>   DW_AT_name        : (indirect string, offset: 0x12ed7c): AHB1LPENR
    <e31>   DW_AT_decl_file   : 4
    <e31>   DW_AT_decl_line   : 1547
    <e33>   DW_AT_decl_column : 17
    <e33>   DW_AT_type        : <0xa12>
    <e37>   DW_AT_data_member_location: 352
 <2><e39>: Abbrev Number: 2 (DW_TAG_member)
    <e3a>   DW_AT_name        : (indirect string, offset: 0x12ed2c): AHB2LPENR
    <e3e>   DW_AT_decl_file   : 4
    <e3e>   DW_AT_decl_line   : 1548
    <e40>   DW_AT_decl_column : 17
    <e40>   DW_AT_type        : <0xa12>
    <e44>   DW_AT_data_member_location: 356
 <2><e46>: Abbrev Number: 2 (DW_TAG_member)
    <e47>   DW_AT_name        : (indirect string, offset: 0x12ed18): AHB4LPENR
    <e4b>   DW_AT_decl_file   : 4
    <e4b>   DW_AT_decl_line   : 1549
    <e4d>   DW_AT_decl_column : 17
    <e4d>   DW_AT_type        : <0xa12>
    <e51>   DW_AT_data_member_location: 360
 <2><e53>: Abbrev Number: 2 (DW_TAG_member)
    <e54>   DW_AT_name        : (indirect string, offset: 0x12ed22): AHB3LPENR
    <e58>   DW_AT_decl_file   : 4
    <e58>   DW_AT_decl_line   : 1550
    <e5a>   DW_AT_decl_column : 17
    <e5a>   DW_AT_type        : <0xa12>
    <e5e>   DW_AT_data_member_location: 364
 <2><e60>: Abbrev Number: 2 (DW_TAG_member)
    <e61>   DW_AT_name        : (indirect string, offset: 0x12eda9): APB1LPENR1
    <e65>   DW_AT_decl_file   : 4
    <e65>   DW_AT_decl_line   : 1551
    <e67>   DW_AT_decl_column : 17
    <e67>   DW_AT_type        : <0xa12>
    <e6b>   DW_AT_data_member_location: 368
 <2><e6d>: Abbrev Number: 2 (DW_TAG_member)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x12edb4): APB1LPENR2
    <e72>   DW_AT_decl_file   : 4
    <e72>   DW_AT_decl_line   : 1552
    <e74>   DW_AT_decl_column : 17
    <e74>   DW_AT_type        : <0xa12>
    <e78>   DW_AT_data_member_location: 372
 <2><e7a>: Abbrev Number: 2 (DW_TAG_member)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x12ecf2): APB2LPENR
    <e7f>   DW_AT_decl_file   : 4
    <e7f>   DW_AT_decl_line   : 1553
    <e81>   DW_AT_decl_column : 17
    <e81>   DW_AT_type        : <0xa12>
    <e85>   DW_AT_data_member_location: 376
 <2><e87>: Abbrev Number: 2 (DW_TAG_member)
    <e88>   DW_AT_name        : (indirect string, offset: 0x12ece8): APB4LPENR
    <e8c>   DW_AT_decl_file   : 4
    <e8c>   DW_AT_decl_line   : 1554
    <e8e>   DW_AT_decl_column : 17
    <e8e>   DW_AT_type        : <0xa12>
    <e92>   DW_AT_data_member_location: 380
 <2><e94>: Abbrev Number: 2 (DW_TAG_member)
    <e95>   DW_AT_name        : (indirect string, offset: 0x12eed7): APB5LPENR
    <e99>   DW_AT_decl_file   : 4
    <e99>   DW_AT_decl_line   : 1555
    <e9b>   DW_AT_decl_column : 17
    <e9b>   DW_AT_type        : <0xa12>
    <e9f>   DW_AT_data_member_location: 384
 <2><ea1>: Abbrev Number: 0
 <1><ea2>: Abbrev Number: 12 (DW_TAG_typedef)
    <ea3>   DW_AT_name        : (indirect string, offset: 0x12ee36): RCC_TypeDef
    <ea7>   DW_AT_decl_file   : 4
    <ea7>   DW_AT_decl_line   : 1556
    <ea9>   DW_AT_decl_column : 3
    <ea9>   DW_AT_type        : <0xafa>
 <1><ead>: Abbrev Number: 3 (DW_TAG_base_type)
    <eae>   DW_AT_byte_size   : 8
    <eaf>   DW_AT_encoding    : 4	(float)
    <eb0>   DW_AT_name        : (indirect string, offset: 0xae207): long double
 <1><eb4>: Abbrev Number: 3 (DW_TAG_base_type)
    <eb5>   DW_AT_byte_size   : 1
    <eb6>   DW_AT_encoding    : 8	(unsigned char)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x105b72): char
 <1><ebb>: Abbrev Number: 3 (DW_TAG_base_type)
    <ebc>   DW_AT_byte_size   : 4
    <ebd>   DW_AT_encoding    : 4	(float)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x65eec): float
 <1><ec2>: Abbrev Number: 3 (DW_TAG_base_type)
    <ec3>   DW_AT_byte_size   : 8
    <ec4>   DW_AT_encoding    : 4	(float)
    <ec5>   DW_AT_name        : (indirect string, offset: 0x52c53): double
 <1><ec9>: Abbrev Number: 21 (DW_TAG_structure_type)
    <eca>   DW_AT_byte_size   : 20
    <ecb>   DW_AT_decl_file   : 5
    <ecc>   DW_AT_decl_line   : 47
    <ecd>   DW_AT_decl_column : 9
    <ece>   DW_AT_sibling     : <0xf0c>
 <2><ed2>: Abbrev Number: 22 (DW_TAG_member)
    <ed3>   DW_AT_name        : Pin
    <ed7>   DW_AT_decl_file   : 5
    <ed8>   DW_AT_decl_line   : 49
    <ed9>   DW_AT_decl_column : 12
    <eda>   DW_AT_type        : <0xa06>
    <ede>   DW_AT_data_member_location: 0
 <2><edf>: Abbrev Number: 9 (DW_TAG_member)
    <ee0>   DW_AT_name        : (indirect string, offset: 0x12f89f): Mode
    <ee4>   DW_AT_decl_file   : 5
    <ee4>   DW_AT_decl_line   : 52
    <ee5>   DW_AT_decl_column : 12
    <ee5>   DW_AT_type        : <0xa06>
    <ee9>   DW_AT_data_member_location: 4
 <2><eea>: Abbrev Number: 9 (DW_TAG_member)
    <eeb>   DW_AT_name        : (indirect string, offset: 0x131a40): Pull
    <eef>   DW_AT_decl_file   : 5
    <eef>   DW_AT_decl_line   : 55
    <ef0>   DW_AT_decl_column : 12
    <ef0>   DW_AT_type        : <0xa06>
    <ef4>   DW_AT_data_member_location: 8
 <2><ef5>: Abbrev Number: 9 (DW_TAG_member)
    <ef6>   DW_AT_name        : (indirect string, offset: 0x12ec47): Speed
    <efa>   DW_AT_decl_file   : 5
    <efa>   DW_AT_decl_line   : 58
    <efb>   DW_AT_decl_column : 12
    <efb>   DW_AT_type        : <0xa06>
    <eff>   DW_AT_data_member_location: 12
 <2><f00>: Abbrev Number: 9 (DW_TAG_member)
    <f01>   DW_AT_name        : (indirect string, offset: 0x12ef0f): Alternate
    <f05>   DW_AT_decl_file   : 5
    <f05>   DW_AT_decl_line   : 61
    <f06>   DW_AT_decl_column : 12
    <f06>   DW_AT_type        : <0xa06>
    <f0a>   DW_AT_data_member_location: 16
 <2><f0b>: Abbrev Number: 0
 <1><f0c>: Abbrev Number: 4 (DW_TAG_typedef)
    <f0d>   DW_AT_name        : (indirect string, offset: 0x12ed8e): GPIO_InitTypeDef
    <f11>   DW_AT_decl_file   : 5
    <f12>   DW_AT_decl_line   : 63
    <f13>   DW_AT_decl_column : 3
    <f14>   DW_AT_type        : <0xec9>
 <1><f18>: Abbrev Number: 23 (DW_TAG_const_type)
    <f19>   DW_AT_type        : <0xf0c>
 <1><f1d>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <f1e>   DW_AT_encoding    : 7	(unsigned)
    <f1f>   DW_AT_byte_size   : 1
    <f20>   DW_AT_type        : <0x9aa>
    <f24>   DW_AT_decl_file   : 5
    <f25>   DW_AT_decl_line   : 69
    <f26>   DW_AT_decl_column : 1
    <f27>   DW_AT_sibling     : <0xf38>
 <2><f2b>: Abbrev Number: 13 (DW_TAG_enumerator)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x1090fa): GPIO_PIN_RESET
    <f30>   DW_AT_const_value : 0
 <2><f31>: Abbrev Number: 13 (DW_TAG_enumerator)
    <f32>   DW_AT_name        : (indirect string, offset: 0x89a02): GPIO_PIN_SET
    <f36>   DW_AT_const_value : 1
 <2><f37>: Abbrev Number: 0
 <1><f38>: Abbrev Number: 4 (DW_TAG_typedef)
    <f39>   DW_AT_name        : (indirect string, offset: 0x1a99a): GPIO_PinState
    <f3d>   DW_AT_decl_file   : 5
    <f3e>   DW_AT_decl_line   : 72
    <f3f>   DW_AT_decl_column : 3
    <f40>   DW_AT_type        : <0xf1d>
 <1><f44>: Abbrev Number: 14 (DW_TAG_subprogram)
    <f45>   DW_AT_external    : 1
    <f45>   DW_AT_name        : (indirect string, offset: 0x12ecb6): HAL_GPIO_Init
    <f49>   DW_AT_decl_file   : 5
    <f49>   DW_AT_decl_line   : 284
    <f4b>   DW_AT_decl_column : 19
    <f4b>   DW_AT_prototyped  : 1
    <f4b>   DW_AT_declaration : 1
    <f4b>   DW_AT_sibling     : <0xf5a>
 <2><f4f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <f50>   DW_AT_type        : <0xf5a>
 <2><f54>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <f55>   DW_AT_type        : <0xf5f>
 <2><f59>: Abbrev Number: 0
 <1><f5a>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <f5b>   DW_AT_byte_size   : 4
    <f5b>   DW_AT_type        : <0xaef>
 <1><f5f>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <f60>   DW_AT_byte_size   : 4
    <f60>   DW_AT_type        : <0xf18>
 <1><f64>: Abbrev Number: 14 (DW_TAG_subprogram)
    <f65>   DW_AT_external    : 1
    <f65>   DW_AT_name        : (indirect string, offset: 0x8a374): HAL_GPIO_WritePin
    <f69>   DW_AT_decl_file   : 5
    <f69>   DW_AT_decl_line   : 298
    <f6b>   DW_AT_decl_column : 19
    <f6b>   DW_AT_prototyped  : 1
    <f6b>   DW_AT_declaration : 1
    <f6b>   DW_AT_sibling     : <0xf7f>
 <2><f6f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <f70>   DW_AT_type        : <0xf5a>
 <2><f74>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <f75>   DW_AT_type        : <0x9fa>
 <2><f79>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <f7a>   DW_AT_type        : <0xf38>
 <2><f7e>: Abbrev Number: 0
 <1><f7f>: Abbrev Number: 25 (DW_TAG_subprogram)
    <f80>   DW_AT_external    : 1
    <f80>   DW_AT_name        : (indirect string, offset: 0x12eca9): MX_GPIO_Init
    <f84>   DW_AT_decl_file   : 1
    <f85>   DW_AT_decl_line   : 37
    <f86>   DW_AT_decl_column : 6
    <f87>   DW_AT_prototyped  : 1
    <f87>   DW_AT_low_pc      : 0x700009b4
    <f8b>   DW_AT_high_pc     : 0x9c
    <f8f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f91>   DW_AT_call_all_tail_calls: 1
 <2><f91>: Abbrev Number: 10 (DW_TAG_variable)
    <f92>   DW_AT_name        : (indirect string, offset: 0x12ec56): GPIO_InitStruct
    <f96>   DW_AT_decl_file   : 1
    <f96>   DW_AT_decl_line   : 40
    <f97>   DW_AT_decl_column : 20
    <f98>   DW_AT_type        : <0xf0c>
    <f9c>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><f9f>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <fa0>   DW_AT_low_pc      : 0x700009ca
    <fa4>   DW_AT_high_pc     : 0x1a
    <fa8>   DW_AT_sibling     : <0xfbb>
 <3><fac>: Abbrev Number: 10 (DW_TAG_variable)
    <fad>   DW_AT_name        : (indirect string, offset: 0x12ece1): tmpreg
    <fb1>   DW_AT_decl_file   : 1
    <fb1>   DW_AT_decl_line   : 43
    <fb2>   DW_AT_decl_column : 3
    <fb3>   DW_AT_type        : <0xa12>
    <fb7>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><fba>: Abbrev Number: 0
 <2><fbb>: Abbrev Number: 27 (DW_TAG_lexical_block)
    <fbc>   DW_AT_low_pc      : 0x700009e4
    <fc0>   DW_AT_high_pc     : 0x1a
 <3><fc4>: Abbrev Number: 10 (DW_TAG_variable)
    <fc5>   DW_AT_name        : (indirect string, offset: 0x12ece1): tmpreg
    <fc9>   DW_AT_decl_file   : 1
    <fc9>   DW_AT_decl_line   : 44
    <fca>   DW_AT_decl_column : 3
    <fcb>   DW_AT_type        : <0xa12>
    <fcf>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><fd2>: Abbrev Number: 0
 <2><fd3>: Abbrev Number: 0
 <1><fd4>: Abbrev Number: 0
  Compilation Unit @ offset 0xfd5:
   Length:        0x6f1 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x419
   Pointer Size:  4
 <0><fe1>: Abbrev Number: 22 (DW_TAG_compile_unit)
    <fe2>   DW_AT_producer    : (indirect string, offset: 0x8cad5): GNU C11 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp.dp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <fe6>   DW_AT_language    : 29	(C11)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x12f040): ../Core/Src/main.c
    <feb>   DW_AT_comp_dir    : (indirect string, offset: 0x118a9c): E:/2.Git/github/stm32h7r7_study/2.software/app/Appli/Debug
    <fef>   DW_AT_ranges      : 0x66
    <ff3>   DW_AT_low_pc      : 0
    <ff7>   DW_AT_stmt_list   : 0x21a4
    <ffb>   DW_AT_macros      : 0x2ed4b
 <1><fff>: Abbrev Number: 3 (DW_TAG_base_type)
    <1000>   DW_AT_byte_size   : 4
    <1001>   DW_AT_encoding    : 7	(unsigned)
    <1002>   DW_AT_name        : (indirect string, offset: 0x8cac8): unsigned int
 <1><1006>: Abbrev Number: 23 (DW_TAG_base_type)
    <1007>   DW_AT_byte_size   : 4
    <1008>   DW_AT_encoding    : 5	(signed)
    <1009>   DW_AT_name        : int
 <1><100d>: Abbrev Number: 3 (DW_TAG_base_type)
    <100e>   DW_AT_byte_size   : 8
    <100f>   DW_AT_encoding    : 5	(signed)
    <1010>   DW_AT_name        : (indirect string, offset: 0x8e72): long long int
 <1><1014>: Abbrev Number: 3 (DW_TAG_base_type)
    <1015>   DW_AT_byte_size   : 8
    <1016>   DW_AT_encoding    : 4	(float)
    <1017>   DW_AT_name        : (indirect string, offset: 0xae207): long double
 <1><101b>: Abbrev Number: 3 (DW_TAG_base_type)
    <101c>   DW_AT_byte_size   : 1
    <101d>   DW_AT_encoding    : 6	(signed char)
    <101e>   DW_AT_name        : (indirect string, offset: 0x105b6b): signed char
 <1><1022>: Abbrev Number: 8 (DW_TAG_typedef)
    <1023>   DW_AT_name        : (indirect string, offset: 0xa402c): __uint8_t
    <1027>   DW_AT_decl_file   : 4
    <1028>   DW_AT_decl_line   : 43
    <1029>   DW_AT_decl_column : 24
    <102a>   DW_AT_type        : <0x102e>
 <1><102e>: Abbrev Number: 3 (DW_TAG_base_type)
    <102f>   DW_AT_byte_size   : 1
    <1030>   DW_AT_encoding    : 8	(unsigned char)
    <1031>   DW_AT_name        : (indirect string, offset: 0x989c1): unsigned char
 <1><1035>: Abbrev Number: 3 (DW_TAG_base_type)
    <1036>   DW_AT_byte_size   : 2
    <1037>   DW_AT_encoding    : 5	(signed)
    <1038>   DW_AT_name        : (indirect string, offset: 0x7ee55): short int
 <1><103c>: Abbrev Number: 3 (DW_TAG_base_type)
    <103d>   DW_AT_byte_size   : 2
